[["Q: What kind of vehicle are these dogs riding in? A: boat", "Q: Are these dogs riding in the boat ? A: yes", "what"], ["Q: Where is the litter bin? A: by sign", "Q: Is the litter bin by a sign ? A: yes", "where"], ["Q: What is the toppings of the pizza to the right? A: broccoli, cheese", "Q: Is the toppings of the pizza to the right broccoli, cheese ? A: yes", "what"], ["Q: What type of material is the bowl made of? A: ceramic", "Q: Is the bowl made of ceramic ? A: yes", "what"], ["Q: Does the animal have long or short hair? A: short", "Q: Does the animal have short hair ? A: yes", "xory_yes"], ["Q: How many animals are there, including the birds? A: 4", "Q: Are there 4 animals , including the birds? A: yes", "yeseqcount"], ["Q: What kind of flowers are these? A: red flowers", "Q: Are these red flowers ? A: yes", "what"], ["Q: Is the guy touching the board? A: no", "N/A", "N/A"], ["Q: How are these people related? A: friends", "Q: Are these people friends? A: yes", "N/A"], ["Q: Where are the buildings? A: in distance", "Q: Are the buildings in the distance ? A: yes", "where"], ["Q: What year is on the bottle? A: 1980", "Q: Is the year 1980 on the bottle ? A: yes", "what"], ["Q: Is this person taking breakfast or lunch? A: lunch", "Q: Is this person taking lunch ? A: yes", "xory_yes"], ["Q: How many of the donuts have orange sugar? A: 11", "Q: Are there 11 donuts that have orange sugar ? A: yes", "yeseqcount"], ["Q: Why is she posing for picture? A: vacation picture", "Q: Is she posing for a vacation picture? A: yes", "N/A"], ["Q: What time is it? A: 11:50", "Q: Is it 11:50 ? A: yes", "what"], ["Q: When is the boy going to get off the elephant? A: noon", "Q: Is the boy going to get off the elephant at noon? A: yes", "N/A"], ["Q: What is the style of lamp shade? A: unsure", "Q: Is the style of lamp shade unsure ? A: yes", "what"], ["Q: Does he have a long sleeve or short sleeve on? A: long sleeve", "Q: Does he have a long sleeve? A: yes", "N/A"], ["Q: What are the main colors on the buses? A: white and teal", "Q: Are the main colors on the buses white and teal ? A: yes", "what"], ["Q: Are the oranges rotten? A: yes", "N/A", "N/A"], ["Q: What is she sitting on? A: sled", "Q: Is she sitting on a sled ? A: yes", "what"], ["Q: Is the boat moving? A: no", "N/A", "N/A"], ["Q: How many planes are in the picture? A: 1", "Q: Is 1 plane in the picture? A: yes", "yeseqcount"], ["Q: What color are the trucks? A: gray", "Q: Are the trucks gray ? A: yes", "what"], ["Q: How many hands do you see? A: 2", "Q: Do you see 2 hands? A: yes", "yeseqcount"], ["Q: Is it a clear day? A: no", "N/A", "N/A"], ["Q: What brand of tires are advertised in the photo? A: omaha", "Q: Are the omaha tires advertised in the photo ? A: yes", "what"], ["Q: What color is this ride? A: pink and yellow", "Q: Is this ride in pink and yellow ? A: yes", "what"], ["Q: What room is in the back of the picture? A: bedroom", "Q: Is it a bedroom in the back of the picture? A: yes", "what"], ["Q: What color is the jet? A: silver,", "Q: Is the jet silver? A: yes", "what"], ["Q: Is this ground hard or soft? A: hard", "Q: Is this ground hard ? A: yes", "xory_yes"], ["Q: What are the men carrying? A: duffel bags", "Q: Are the men carrying duffel bags ? A: yes", "what"], ["Q: What color balloons do you see? A: blue, red and green", "Q: Do you see balloons in blue, red and green? A: yes", "what"], ["Q: What is in the sky? A: lift chairs", "Q: Is the lift chairs in the sky ? A: yes", "what"], ["Q: Are these birds flying in the air? A: yes", "N/A", "N/A"], ["Q: What is happening to the animal? A: being skinned", "Q: Is the animal being skinned? A: yes", "what"], ["Q: Is this picture from the city of Detroit? A: can't tell", "N/A", "N/A"], ["Q: Are all the boarders wearing shorts? A: no", "N/A", "N/A"], ["Q: Why does the woman have her hair pulled back? A: yes", "N/A", "N/A"], ["Q: Where are the giraffes? A: savanna", "Q: Are the giraffes in the savanna ? A: yes", "where"], ["Q: How much wine has he drank? A: 1/2 bottle", "Q: Has he drank 1/2 bottle of wine? A: yes", "N/A"], ["Q: What expression/action do the two appear to be exercising? A: confusion", "Q: Do the two appear to be confused ? A: yes", "what"], ["Q: What meat is in this dish? A: shrimp", "Q: Is shrimp in this dish ? A: yes", "what"], ["Q: Has this dog been legally licensed? A: hopefully", "N/A", "N/A"], ["Q: How old do you think the groom is? A: 32", "Q: Do you think the groom is 32 years old? A: yes", "N/A"], ["Q: Are these animals goats? A: bulls", "Q: Are these animals bulls? A: yes", "N/A"], ["Q: What color is the girls outfit? A: blue", "Q: Is the girls outfit in blue ? A: yes", "what"], ["Q: How tall are these giraffes? A: 10 feet", "Q: Are these giraffes 10 feet tall? A: yes", "N/A"], ["Q: Where is the clock? A: street corner", "Q: Is the clock on the street corner ? A: yes", "where"], ["Q: What is she eating? A: bread", "Q: Is she eating bread ? A: yes", "what"], ["Q: What is the name of the Avenue? A: no avenue present", "Q: Is there any avenue present? A: no", "what"], ["Q: Why kind of bird is walking in front of the woman? A: goose", "Q: Is the bird walking in front of the woman a goose? A: yes", "N/A"], ["Q: How many boxes of pizza are there? A: 5", "Q: Are there 5 boxes of pizza ? A: yes", "yeseqcount"], ["Q: What kind of bird? A: finch", "Q: Is this a finch? A: yes", "N/A"], ["Q: What vehicle is in the background? A: yes", "N/A", "what"], ["Q: Is this picture out of focus? A: no", "Q: Is the picture in focus? A: yes", "N/A"], ["Q: What is the owner about to do with these fruits and vegetables? A: blend", "Q: Is the owner about to blend these fruits and vegetables ? A: yes", "what"], ["Q: What is the photo distorted? A: walls", "N/A", "what"], ["Q: What are the people on the stage doing? A: performing", "Q: Are the people on the stage performing ? A: yes", "what"], ["Q: What is in the sky? A: airplane and clouds", "Q: Is the airplane and clouds in the sky ? A: yes", "what"], ["Q: Why is it dark? A: twilight", "Q: Is the darkness because of the twilight? A: yes", "N/A"], ["Q: Is the toilet paper dispenser on the left or right of the toilet? A: left", "Q: Is the toilet paper dispenser on the left ? A: yes", "xory_yes"], ["Q: Where is the snowman? A: to far left", "Q: Is the snowman to the far left ? A: yes", "where"], ["Q: What is the child digging around in? A: fridge", "Q: Is the child digging around in a fridge ? A: yes", "what"], ["Q: What shape is this fruit? A: oblong", "Q: Is this fruit oblong shaped? A: yes", "what"], ["Q: What is the woman carrying in her hand? A: food", "Q: Is the woman carrying food in her hand ? A: yes", "what"], ["Q: What faction does the character on the screen belong to? A: archer", "Q: Does the character on the screen belong to the archer faction? A: yes", "what"], ["Q: How many pictures are hanging on the wall? A: many", "Q: Are there many pictures hanging on the wall? A: yes", "N/A"], ["Q: What are the horses doing? A: being petted", "Q: Are the horses being petted ? A: yes", "what"], ["Q: What is the lady doing? A: going into water", "Q: Is the lady going into water ? A: yes", "what"], ["Q: Why are the players legs so far apart? A: hit ball", "Q: Are the players legs so far apart for hitting balls? A: yes", "N/A"], ["Q: What date was the photo taken? A: 07 16 2013", "Q: Was the photo taken 07 16 2013 ? A: yes", "what"], ["Q: What kind of court is she playing on? A: none", "Q: Is she playing on any kinds of court ? A: no", "what"], ["Q: Who made this pizza? A: person", "Q: Did a person make this pizza? A: yes", "N/A"], ["Q: Where is the caboose? A: by house", "Q: Is the caboose by the house ? A: yes", "where"], ["Q: What kind of does the woman have in her mouth? A: kielbasa", "N/A", "what"], ["Q: Where are people in the picture? A: waiting on platform", "Q: Are people in the picture waiting on the platform ? A: yes", "where"], ["Q: Is this man cooking food in the oven? A: yes", "N/A", "N/A"], ["Q: How many compartments does the suitcase have? A: 6", "Q: Does the suitcase have 6 compartments? A: yes", "yeseqcount"], ["Q: What kind of game is instigated when the blue car drives by? A: i spy", "Q: Is the game instigated when the blue car drives by i spy ? A: yes", "what"], ["Q: How many kids are here? A: 5", "Q: Are there 5 kids here ? A: yes", "yeseqcount"], ["Q: How many berries will the bird pick? A: 2", "Q: Will the bird pick 2 berries? A: yes", "yeseqcount"], ["Q: What is for dinner? A: food", "Q: Is the food for dinner ? A: yes", "what"], ["Q: Is this called crudites? A: yes", "N/A", "N/A"], ["Q: Why is this room warm? A: oven", "Q: Is the oven making the room warm? A: yes", "N/A"], ["Q: What kind of photo is this? A: candid", "Q: Is this a candid photo? A: yes", "what"], ["Q: Is the boat on water? A: no", "N/A", "N/A"], ["Q: What is the name of this Avenue? A: manila and first", "Q: Is the name of this Avenue manila and first ? A: yes", "what"], ["Q: What is this person doing? A: cuddling", "Q: Is this person cuddling ? A: yes", "what"], ["Q: What is the man playing? A: yes", "N/A", "what"], ["Q: How many cars do you see? A: 4", "Q: Do you see 4 cars? A: yes", "yeseqcount"], ["Q: Is the man wearing a bowtie? A: no", "N/A", "N/A"], ["Q: What is on the plate? A: hamburgers fries and drink", "Q: Are the hamburgers fries and drink on the plate ? A: yes", "what"], ["Q: What business is the truck for? A: merrick guernsey", "Q: Is the truck for merrick guernsey ? A: yes", "what"], ["Q: How much does this little itty bitty kitty weigh? A: 10 lb", "Q: Does this little itty bitty kitty weigh 10 lb? A: yes", "N/A"], ["Q: What is the color of the field? A: green & orange", "Q: Is the color of the field green & orange ? A: yes", "what"], ["Q: How much broccoli is there? A: 33", "Q: is there 33 broccoli ? A: yes", "N/A"], ["Q: What race is the boy in the picture? A: caucasian", "Q: Is the boy in the picture caucasian ? A: yes", "what"], ["Q: What does the license plate of the van say? A: 467", "Q: Does the license plate of the van say 467 ? A: yes", "what"], ["Q: What is the stuffed animal on this person's chest? A: tie", "N/A", "what"], ["Q: What vegetables are on the plate? A: none", "Q: Are there any vegetables on the plate ? A: no", "what"], ["Q: What is on top of table in the vase? A: air", "Q: Is the air on top of table in the vase ? A: yes", "what"], ["Q: What is on their hand? A: hot dog", "Q: Is the hot dog on their hand ? A: yes", "what"], ["Q: What type of device is on the table? A: desktop", "Q: Is the device on the table a desktop? A: yes", "what"], ["Q: Is this plate on the edge of the table? A: yes", "N/A", "N/A"], ["Q: How many cars are on the road? A: 8", "Q: Are 8 cars on the road? A: yes", "yeseqcount"], ["Q: What is the boy doing? A: cutting paper", "Q: Is the boy cutting paper ? A: yes", "what"], ["Q: What number is on the first horse? A: 8", "Q: Is number 8 on the first horse ? A: yes", "what"], ["Q: What color is the picture? A: multi", "Q: Is the picture in multi colors ? A: yes", "what"], ["Q: What kind of bed is this? A: normal", "Q: Is this a normal bed? A: yes", "what"], ["Q: What is the color of the toilet? A: aqua blue", "Q: Is the color of the toilet aqua blue ? A: yes", "what"], ["Q: Is the pattern on the back pockets of these jeans typical of a pair of Levi's? A: no", "N/A", "N/A"], ["Q: What is the player in red shorts touching with his right hand? A: helmet", "Q: Is the player in red shorts touching the helmet with his right hand ? A: yes", "what"], ["Q: Where is the dog's head? A: on book", "Q: Is the dog's head on the book ? A: yes", "where"], ["Q: What base is the player closest to? A: baseball base", "Q: Is the player closest to the baseball base ? A: yes", "what"], ["Q: What color or colors are on the towel to the left lying in the sand? A: there is no sand", "Q: Are there any sand ? A: no", "what"], ["Q: Which of these laptops is the most outdated? A: one in middle", "Q: Is the laptop in the middle most outdated? A: yes", "N/A"], ["Q: Who is laying on the bed? A: man", "Q: Is the man laying on the bed? A: yes", "N/A"], ["Q: Could the man have fallen? A: no", "N/A", "N/A"], ["Q: What is the red bottle represent? A: fire hydrant", "Q: Does the red bottle represent a fire hydrant ? A: yes", "what"], ["Q: What is the man sitting on? A: wheelchair", "Q: Is the man sitting on a wheelchair ? A: yes", "what"], ["Q: What kind of sandwich was purchased? A: steak and egg", "Q: Was the steak and egg sandwitch purchased ? A: yes", "what"], ["Q: Is the man preparing a pre-made dish? A: no", "N/A", "N/A"], ["Q: What color is the dish the orange is on? A: white", "Q: Is the dish the orange is on white ? A: yes", "what"], ["Q: What kind of meat is on the pizza? A: sausage", "Q: Is the sausage on the pizza ? A: yes", "what"], ["Q: How many elephants are drinking water? A: yes", "N/A", "N/A"], ["Q: What is this woman wearing around her ankle? A: socks", "Q: Is the woman wearing socks around her ankle ? A: yes", "what"], ["Q: What type of airplane is shown? A: old", "Q: Is the airplan shown old? A: yes", "what"], ["Q: Does the pizza look good to eat? A: yes", "N/A", "N/A"], ["Q: Is the plane heading towards or away from the camera? A: away", "Q: Is the plane heading away from the camera? A: yes", "N/A"], ["Q: How many pizza pans are there? A: 1", "Q: Is there 1 pizza pan ? A: yes", "yeseqcount"], ["Q: Do the windows have screens? A: yes", "N/A", "N/A"], ["Q: Where is the bell  located in this photograph? A: behind door", "Q: Is the bell behind the door ? A: yes", "where"], ["Q: Does the animal have long or short hair? A: both", "Q: Does the animal have both long and short hair? A: yes", "N/A"], ["Q: Does this have marshmallows? A: yes", "N/A", "N/A"], ["Q: Why is this horse behind a fence? A: not wild horse", "Q: Is this horse behind a fence because it's not wild? A: yes", "N/A"], ["Q: What is the baby sitting on? A: person", "Q: Is the baby sitting on a person ? A: yes", "what"], ["Q: What has been changed in this photo? A: faces", "Q: Has the faces been changed in this photo ? A: yes", "what"], ["Q: What are the green things? A: green beans", "Q: Are the green things green beans ? A: yes", "what"], ["Q: How many lights are on in the building? A: 20", "Q: Are there 20 lights on in the building? A: yes", "yeseqcount"], ["Q: What breed of dog is on the left? A: border collie", "Q: Is the border collie on the left ? A: yes", "what"], ["Q: Is there a white horse in the back? A: no", "N/A", "N/A"], ["Q: What time of day is it? A: 10:05", "Q: Is it 10:05 ? A: yes", "what"], ["Q: What letter is on the pitchers head? A: a", "Q: Is the letter A on the pitchers head ? A: yes", "what"], ["Q: Are these vehicles in motion? A: no", "N/A", "N/A"], ["Q: What color vest is the first man wearing? A: orange and yellow", "Q: Is the first man wearing orange and yellow ? A: yes", "what"], ["Q: What sport are the people participating in? A: skiing", "Q: Are the people skiing ? A: yes", "what"], ["Q: What color is the man's surfboard? A: black", "Q: Is the man 's surfboard black ? A: yes", "what"], ["Q: Is the man's hair red? A: no", "N/A", "N/A"], ["Q: How many animals are the in photograph? A: 2", "Q: Are there 2 animals the in photograph? A: yes", "yeseqcount"], ["Q: Is this an advertisement for an appliance store? A: no", "N/A", "N/A"], ["Q: Is he watching the cameraman? A: yes", "N/A", "N/A"], ["Q: What utensils are being used? A: fork", "Q: Are the fork being used ? A: yes", "what"], ["Q: What letters on visible on his ski? A: k", "Q: Is the letter K visible on his ski? A: k", "N/A"], ["Q: Is there more than 1 boy? A: no", "N/A", "N/A"], ["Q: Are the skater's feet on the board? A: no", "N/A", "N/A"], ["Q: How many birds in the sky? A: 3", "Q: Are there 3 birds in the sky ? A: yes", "yeseqcount"], ["Q: What type of animal is the stuffed animal? A: dog", "Q: Is the stuffed animal a dog ? A: yes", "what"], ["Q: What is on the net? A: line", "Q: Is the line on the net ? A: yes", "what"], ["Q: What is the cord that runs in front of the couch? A: laptop charger", "Q: Is the cord that runs in front of the couch laptop a charger ? A: yes", "what"], ["Q: What animal is shown? A: tan", "Q: Is the animal shown a tan? A: yes", "what"], ["Q: What is the plate number of the front bus? A: 838", "Q: Is the plate number of the front bus 838 ? A: yes", "what"], ["Q: How is the vegetation? A: lush and green", "Q: Is the vegetation lush and green? A: yes", "N/A"], ["Q: What word is in light blue on the computer screen? A: google", "Q: Is the word in light blue on the computer screen google? A: yes", "what"], ["Q: Why do the apples have paper on them? A: they are present", "Q: Do the apples have paper on them because they are presents? A: yes", "N/A"], ["Q: Where are the words written in this picture? A: on signs", "Q: Are the words written in this picture \"on the signs\" ? A: yes", "where"], ["Q: What is the woman doing holding a controller? A: wii", "Q: Is the woman playing wii ? A: yes", "what"], ["Q: Does the animal appear to be relaxed? A: no", "N/A", "N/A"], ["Q: What color are the diamonds on the floor? A: black", "Q: Are the diamonds on the floor black ? A: yes", "what"], ["Q: What is that blue thing behind the cow? A: bucket", "Q: Is that blue thing behind the cow a bucket ? A: yes", "what"], ["Q: Where are the men playing Frisbee? A: for fun", "N/A", "where"], ["Q: How many seats? A: 18", "Q: Are there 18 seats ? A: yes", "yeseqcount"], ["Q: Who is the lady? A: woman", "N/A", "N/A"], ["Q: What does this person have on his head? A: toboggan", "Q: Does this person have a toboggan on his head ? A: yes", "what"], ["Q: What colors are the suitcases? A: blue", "Q: Are the suitcases blue ? A: yes", "what"], ["Q: What is in these bottles? A: water", "Q: Is there water in these bottles ? A: yes", "what"], ["Q: What number is on this bike? A: 1", "Q: Is the number 1 on this bike ? A: yes", "what"], ["Q: Is there an ice cream truck? A: no", "N/A", "N/A"], ["Q: How many kites are flying? A: 5", "Q: Are there 5 kites flying? A: yes", "yeseqcount"], ["Q: What is the culinary term for celery, carrots and onions? A: yes", "N/A", "what"], ["Q: Is it possible to determine the origin of the boat? A: yes", "N/A", "N/A"], ["Q: Is there sun coming into the room? A: yes", "N/A", "N/A"], ["Q: Do the potatoes still have their skins? A: no", "N/A", "N/A"], ["Q: What color is the suitcase? A: red", "Q: Is the suitcase red ? A: yes", "what"], ["Q: Are all of the animals adults? A: no", "N/A", "N/A"], ["Q: Which team has control of the ball? A: red & black team", "Q: Does the red & black team have control of the ball? A: yes", "N/A"], ["Q: What are the people doing on the grass? A: kiting", "Q: are the people kiting on the grass ? A: yes", "what"], ["Q: What is the kitty doing with the remote? A: guarding", "Q: Is the kitty guarding the remote? A: yes", "what"], ["Q: Is there a ball in the water? A: no", "N/A", "N/A"], ["Q: What is in the round container? A: cinnamon", "Q: Is the cinnamon in the round container ? A: yes", "what"], ["Q: How many animal is there? A: 1", "Q: Is there 1 animal ? A: yes", "yeseqcount"], ["Q: What is the man about to do? A: skateboard", "Q: Is the man about to skateboard ? A: yes", "what"], ["Q: What pattern is on the stuffed animal? A: no pattern solid brown", "Q: Is the stuffed animal in solid brown? A: yes", "what"], ["Q: What is the boy doing? A: batting", "Q: Is the boy batting ? A: yes", "what"], ["Q: Is the elephant in a cage? A: no", "N/A", "N/A"], ["Q: What kind of shoes are near the toilet? A: slip ons", "Q: Are the slip ons near the toilet ? A: yes", "what"], ["Q: What type of building is seen in the center? A: dorm", "Q: Is a dorm seen in the center ? A: yes", "what"], ["Q: What fruit is this? A: banana and oranges and pears and peaches", "Q: Is this banana and oranges and pears and peaches ? A: yes", "what"], ["Q: Are these cattle tagged? A: yes", "N/A", "N/A"], ["Q: What color is the man's pot? A: red", "Q: Is the man 's pot red ? A: yes", "what"], ["Q: What color is the hat on his head? A: gray, beige", "Q: Is the hat on his head gray and beige ? A: yes", "what"], ["Q: How many people are not on the ski lift? A: 5", "Q: Are there 5 people not on the ski lift? A: yes", "yeseqcount"], ["Q: What are the three main colors of the bus? A: white, black and green", "Q: Are the three main colors of the bus white, black and green ? A: yes", "what"], ["Q: Where is the wine bottle? A: left side", "Q: Is the wine bottle on the left side ? A: yes", "where"], ["Q: What letter is on the racket? A: b", "Q: Is the letter b on the racket ? A: yes", "what"], ["Q: Where are these people eating? A: work", "Q: Are these people eating at work ? A: yes", "where"], ["Q: What color is the biggest umbrella? A: yellow", "Q: Is the biggest umbrella yellow ? A: yes", "what"], ["Q: What color is her shirt? A: teal", "Q: Is her shirt teal ? A: yes", "what"], ["Q: What is the occupation of the man in the brown uniform? A: police officer", "Q: Is the man in the brown uniform a police officer ? A: yes", "what"], ["Q: How many traffic lights are in the picture? A: 11", "Q: Are there 11 traffic lights in the picture? A: yes", "yeseqcount"], ["Q: What are all those people doing there? A: on boat", "Q: Are all those people on boat ? A: yes", "what"], ["Q: What appears on the bears face to make him/her look frightening? A: blood", "Q: Does the blood on the bears face make him / her look frightening? A: yes", "what"], ["Q: Why are these people carrying umbrellas? A: yes", "N/A", "N/A"], ["Q: Is the plane flying too low? A: yes", "N/A", "N/A"], ["Q: Is this floor real wood? A: yes", "N/A", "N/A"], ["Q: What number is on the train? A: unknown", "Q: Is the number on the train unknown? A: yes", "what"], ["Q: Why is there bare ground under the tree? A: unsure", "N/A", "N/A"], ["Q: What is the airplane doing? A: flying", "Q: Is the airplane flying ? A: yes", "what"], ["Q: Is this man going to have a sunburn? A: possibly", "N/A", "N/A"], ["Q: What type of bread is that? A: bun", "Q: Is that a bun ? A: yes", "what"], ["Q: What kind of necktie is the man wearing? A: colorful", "Q: Is the man wearing a colorful necktie? A: yes", "what"], ["Q: Is the street of cobblestone? A: no", "N/A", "N/A"], ["Q: What's the color of the SUV besides the truck? A: tan", "Q: Is the SUV besides the truck in tan ? A: yes", "what"], ["Q: What two fruits make up the dish shown at the bottom? A: banana and strawberry", "Q: Does banana and strawberry make up the dish shown at the bottom ? A: yes", "what"], ["Q: What food is to the left of the carrots? A: broccoli", "Q: Is the broccoli to the left of the carrots ? A: yes", "what"], ["Q: Where is the garbage can? A: left", "Q: Is the garbage can on the left ? A: yes", "where"], ["Q: What brand of stove is in the kitchen? A: unknown", "Q: Is the brand of stove in the kitch known ? A: no", "what"], ["Q: How many people are in the court? A: 2", "Q: Are there 2 people in the court? A: yes", "yeseqcount"], ["Q: Where is there a place to sit? A: yes", "N/A", "where"], ["Q: Why would someone want to keep these empty bottles? A: put water in", "Q: Would someone want to keep these empty bottles for putting water in? A: yes", "N/A"], ["Q: How tall is the wave in this picture? A: 5 '", "N/A", "N/A"], ["Q: Whose ab muscles are the least defined? A: middle man's", "Q: Is the middle man's ab muscles the least defined? A: yes", "N/A"], ["Q: How many books are in the image? A: 9", "Q: Are there 9 books in the image? A: yes", "yeseqcount"], ["Q: Is this a big wave? A: yes", "N/A", "N/A"], ["Q: How many beers can you clearly make out? A: 7", "Q: Can you clearly make out 7 beers? A: yes", "yeseqcount"], ["Q: What is above the fireplace? A: candles, vases, picture", "Q: Are the candles, vases, picture above the fireplace ? A: yes", "what"], ["Q: What is the cat sitting next to? A: computer", "Q: Is the cat sitting next to the computer ? A: yes", "what"], ["Q: What color jacket is the child wearing? A: yellow", "Q: Is the child wearing a yellow jacket? A: yes", "what"], ["Q: Are there carrots in this dish? A: no", "N/A", "N/A"], ["Q: Are the people eating food from a box? A: yes", "N/A", "N/A"], ["Q: What sport is the person partaking in? A: surfboarding", "Q: Is the person partaking in surfboarding ? A: yes", "what"], ["Q: In what city do you think this photo was taken? A: in new york", "Q: Do you think this photo was taken in new york? A: yes", "N/A"], ["Q: Who is filming? A: man in green pants", "Q: Is the man in green pants filming? A: yes", "N/A"], ["Q: What kind of door way is there? A: close", "N/A", "what"], ["Q: How many birds are there? A: 15", "Q: Are there 15 birds ? A: yes", "yeseqcount"], ["Q: What is the dog wearing? A: tee shirt", "Q: Is the dog wearing a tee shirt ? A: yes", "what"], ["Q: What colors are the fire hydrant? A: red white and blue", "Q: Is the fire hydrant in red white and blue ? A: yes", "what"], ["Q: What game console is this? A: not game console", "Q: Is this a game console ? A: no", "what"], ["Q: What city was the photo taken in? A: san francisco", "Q: Was the photo taken in san francisco ? A: yes", "what"], ["Q: Why is the man raising his leg? A: gameplay", "Q: Is the man raising his leg for gameplay? A: yes", "N/A"], ["Q: What is the player holding in their glove? A: nothing", "Q: Is the player holding anything in their glove ? A: no", "what"], ["Q: What is the elephant's trunk hanging over? A: railing", "Q: Is the elephant 's trunk hanging over the railing ? A: yes", "what"], ["Q: What is on the shelf in the background? A: dishware", "Q: Is the dishware on the shelf in the background ? A: yes", "what"], ["Q: What does the white sign read? A: no bed crossing use crosswalk", "Q: Does the white sign read \"no bed crossing use crosswalk\" ? A: yes", "what"], ["Q: What does the white sign say? A: nashi sushi chopsticks", "Q: Does the white sign say \"nashi sushi chopsticks\" ? A: yes", "what"], ["Q: What kind of vegetable is on the sandwiches? A: onions", "Q: Are the vegetables on the sandwiches onions? A: yes", "what"], ["Q: Where is the train on the tracks? A: purple", "N/A", "where"], ["Q: What time of day is it? A: early", "Q: Is it early ? A: yes", "what"], ["Q: What color are this animal's eyes? A: gray", "Q: Are this animal 's eyes gray ? A: yes", "what"], ["Q: How many pens? A: 5", "Q: Are there 5 pens ? A: yes", "yeseqcount"], ["Q: What is on the window behind the signs? A: bars", "Q: Are the bars on the window behind the signs ? A: yes", "what"], ["Q: What are the animals? A: flamingo", "Q: Are the animals flamingo ? A: yes", "what"], ["Q: What word can be read on the person's shirt? A: softball", "Q: Is the word on the person's shirt \"softball\" ? A: yes", "what"], ["Q: What color is the sky? A: blue with clouds", "Q: Is the sky blue with clouds ? A: yes", "what"], ["Q: What state is this in? A: california", "Q: Is this in a california ? A: yes", "what"], ["Q: Is the kite flying high enough? A: no", "N/A", "N/A"], ["Q: What is around the edge of the field? A: gravel", "Q: Is the gravel around the edge of the field ? A: yes", "what"], ["Q: Was the photographer standing or on stilts? A: no", "N/A", "N/A"], ["Q: What kind of building does this look like it might be? A: capital", "Q: Does this look like it might be capital ? A: yes", "what"], ["Q: What kind of meat is on the plate? A: fish", "Q: Is the fish on the plate ? A: yes", "what"], ["Q: Why are all the cars alike? A: fleet", "N/A", "N/A"], ["Q: What is keeping the horses from running away? A: reins", "Q: Are the reins keeping the horses from running away ? A: yes", "what"], ["Q: What is the round object? A: railroad crossing sign", "Q: Is the round object railroad crossing sign ? A: yes", "what"], ["Q: What color are the giraffes? A: brown and orange", "Q: Are the giraffes brown and orange ? A: yes", "what"], ["Q: How would you describe their occupation? A: students", "Q: Would you describe them as students? A: yes", "N/A"], ["Q: What somewhat unusual garment is the groom wearing for bottoms? A: stars", "Q: Is the groom wearing stars for bottoms ? A: yes", "what"], ["Q: Is the vehicle new? A: no", "N/A", "N/A"], ["Q: Is the girl wearing socks? A: no", "N/A", "N/A"], ["Q: What is the name of the team at bat? A: blue jays", "Q: Is the name of the team at bat blue jays ? A: yes", "what"], ["Q: What part of the plane is visible? A: whole plane", "Q: Is the whole plane visible? A: yes", "what"], ["Q: What is written on the sign? A: fly emirates", "Q: Is the word \"fly emirates\" written on the sign ? A: yes", "what"], ["Q: What is the man doing with the driver? A: talking", "Q: is the man talking with the driver ? A: yes", "what"], ["Q: How frequently is the corner business open? A: 6 days week", "Q: Does the corner business open 6 days a week? A: yes", "N/A"], ["Q: What kind of cattle is pictured? A: black and white", "Q: Is the black and white cattle pictured ? A: yes", "what"], ["Q: What is strange about this photo? A: nothing", "Q: Is there anything strange about this photo ? A: no", "what"], ["Q: How many windows are there? A: 100", "Q: Are there 100 windows ? A: yes", "yeseqcount"], ["Q: What color is tennis court? A: blue and green", "Q: Is the tennis court blue and green ? A: yes", "what"], ["Q: How are the kids getting the water they are playing in? A: hydrant", "Q: are the kids getting the water they are playing in through hydrant? A: yes", "N/A"], ["Q: Is the woman safely riding in the street? A: no", "N/A", "N/A"], ["Q: What is the car on the left commonly used for? A: fighting fire", "Q: Is the car on the left commonly used for fighting fire? A: yes", "what"], ["Q: Who has a camera? A: seated man in white t-shirt with black lettering", "Q: Does the seated man in white t-shirt with black lettering has a camera? A: yes", "N/A"], ["Q: How many windows are on the building? A: 45", "Q: Are there 45 windows on the building? A: yes", "yeseqcount"], ["Q: What color is the tissue? A: black and white", "Q: Is the tissue black and white ? A: yes", "what"], ["Q: How many kids in the picture? A: 3", "Q: Are there 3 kids in the picture ? A: yes", "yeseqcount"], ["Q: What color is the desk? A: blue", "Q: Is the desk blue ? A: yes", "what"], ["Q: What is the room used for? A: bathing", "Q: Is the room used for bathing ? A: yes", "what"], ["Q: What shape of pan would you cook this in? A: circle", "Q: Would you cook this in a circle shaped pan? A: yes", "what"], ["Q: What kind of object is being used to keep the bear from accessing the garbage can? A: garbage can", "N/A", "what"], ["Q: What is this bird? A: stork", "Q: Is this bird a stork ? A: yes", "what"], ["Q: What type of street is the car driving on? A: gray", "Q: Is the car driving on a gray street? A: yes", "what"], ["Q: What is on the grass? A: fire-hydrant", "Q: Is the fire-hydrant on the grass ? A: yes", "what"], ["Q: Is this picture black and white? A: yes", "N/A", "N/A"], ["Q: What color are the lines on the train? A: white", "Q: Are the lines on the train white ? A: yes", "what"], ["Q: What brand of toothpaste is that? A: blended", "Q: Is that a blended toothpaste? A: yes", "what"], ["Q: What are the people doing tonight? A: eating hot dogs", "Q: are the people eating hot dogs tonight ? A: yes", "what"], ["Q: Is there a water bottle on the sink? A: yes", "N/A", "N/A"], ["Q: Is he flat-footed? A: no", "N/A", "N/A"], ["Q: Is the refrigerator capacity greater than 22 cubic feet? A: greater", "N/A", "N/A"], ["Q: What are the street names? A: garni geghard", "Q: Are the street names garni geghard ? A: yes", "what"], ["Q: What brand are the players cleats? A: adidas and nike", "Q: Are these adidas and nike players cleats ? A: yes", "what"], ["Q: What type of road is the truck on? A: highway", "Q: Is the truck on a highway ? A: yes", "what"], ["Q: What airline operates this plane? A: delta", "Q: Does delta operate this plane? A: yes", "what"], ["Q: How many people are in the bus? A: 4", "Q: Are 4 people in the bus? A: yes", "yeseqcount"], ["Q: Where is the remote control? A: table", "Q: Is the remote control on the table ? A: yes", "where"], ["Q: Is there grass in the background of this picture? A: no", "N/A", "N/A"], ["Q: How many people on skis? A: at least 20", "N/A", "N/A"], ["Q: How many whiskers does the cat have on the right side of it's face? A: 4", "Q: Does the cat have on the right side of it 's face 4 whiskers? A: yes", "yeseqcount"], ["Q: From what height was the picture taken? A: 6 feet", "N/A", "N/A"], ["Q: What time is it in the picture? A: morning", "Q: Is it morning in the picture ? A: yes", "what"], ["Q: What kind of grass is this? A: bluegrass", "Q: Is this a bluegrass ? A: yes", "what"], ["Q: Where are the suitcases? A: on security conveyor", "Q: Are the suitcases on a security conveyor ? A: yes", "where"], ["Q: Who is squeeze in between the big bear? A: pig", "N/A", "N/A"], ["Q: Where is the bird? A: on board", "Q: Is the bird on the board ? A: yes", "where"], ["Q: How many boats are on the lake? A: 7", "Q: Are 7 boats on the lake? A: yes", "yeseqcount"], ["Q: What is the orange vegetable? A: carrot", "Q: Is the orange vegetable carrot ? A: yes", "what"], ["Q: How many full slices of pepperoni are visible? A: 10", "Q: Are 10 full slices of pepperoni visible? A: yes", "yeseqcount"], ["Q: Are both zebras facing the camera? A: no", "N/A", "N/A"], ["Q: What color is the car? A: it is truck, not car", "Q: Is the car it is truck, not car ? A: yes", "what"], ["Q: What color are the tags? A: white", "Q: Are the tags white ? A: yes", "what"], ["Q: What is on the sink? A: toothpaste", "Q: Is the toothpaste on the sink ? A: yes", "what"], ["Q: What is this person riding? A: surfboard", "Q: Is this person riding a surfboard ? A: yes", "what"], ["Q: Are the people about to eat? A: yes", "N/A", "N/A"], ["Q: What is all those luggage doing there? A: being towed", "Q: is all those luggage being towed there ? A: yes", "what"], ["Q: What color would you expect this object to be? A: black", "Q: Would you expect this object to be black ? A: yes", "what"], ["Q: What is the color of the batter's wristband? A: red", "Q: Is the color of the batter 's wristband red ? A: yes", "what"], ["Q: What color is the floor? A: multicolored", "Q: Is the floor multicolored ? A: yes", "what"], ["Q: What is on the sand? A: horses hooves", "Q: Are the horses hooves on the sand ? A: yes", "what"], ["Q: Is the object being held in the person's right hand or left hand? A: right", "N/A", "N/A"], ["Q: What activity is being undertaken? A: kite", "Q: Is the kite being undertaken ? A: yes", "what"], ["Q: What color tie is this man wearing? A: silver", "Q: Is this man wearing silver ? A: yes", "what"], ["Q: What state is this photo taken? A: nebraska", "Q: Is this photo taken nebraska ? A: yes", "what"], ["Q: Where does it look like this vehicle is parked? A: alcove", "Q: Does it look like this vehicle is parked alcove ? A: yes", "where"], ["Q: Where are the patrons? A: bleachers", "Q: Are the patrons in the bleachers ? A: yes", "where"], ["Q: What is the sign doing? A: stop", "Q: Is the sign doing stop ? A: yes", "what"], ["Q: What animal is this type of airplane nicknamed after? A: bird", "Q: Is this type of airplane nicknamed after the bird ? A: yes", "what"], ["Q: Is this a skinny vehicle? A: no", "N/A", "N/A"], ["Q: What type of dessert is this? A: cupcakes", "Q: Is this a cupcakes ? A: yes", "what"], ["Q: Whose name is in the picture? A: luis paulo de sa", "N/A", "N/A"], ["Q: Where is a vending machine? A: opposite track", "Q: Is a vending machine opposite track ? A: yes", "where"], ["Q: What is the sidewalk made out of? A: brick", "Q: Is the sidewalk made out of brick ? A: yes", "what"], ["Q: What is he wearing? A: surf suit", "Q: Is he wearing a surf suit ? A: yes", "what"], ["Q: What material is the tabletop? A: tile", "Q: Is the tabletop tile ? A: yes", "what"], ["Q: What color are the ladles? A: white", "Q: Are the ladles white ? A: yes", "what"], ["Q: What is the lady holding in her right hand? A: poles", "Q: Is the lady holding in her right hand poles ? A: yes", "what"], ["Q: What kind of bun is this? A: sourdough", "Q: Is this a sourdough ? A: yes", "what"], ["Q: What time is it in the picture? A: 9:00", "Q: Is it 9:00 in the picture ? A: yes", "what"], ["Q: Is it mating season? A: yes", "N/A", "N/A"], ["Q: Is this house being refurbished? A: yes", "N/A", "N/A"], ["Q: Was the photographer in a plane while taking this picture? A: yes", "N/A", "N/A"], ["Q: Who cleans this house? A: parents", "Q: Do parents cleans this house? A: yes", "N/A"], ["Q: What kind of notebook does she have? A: ebook", "Q: Does she have ebook ? A: yes", "what"], ["Q: What type of wood is the floor likely made of? A: mahogany", "Q: Is the floor likely made of mahogany ? A: yes", "what"], ["Q: Were the birds at rest or moving when the picture was taken? A: at rest", "Q: Were the birds at rest when the picture was taken? A: yes", "N/A"], ["Q: What color is this bird? A: yellow orange and black", "Q: Is this bird yellow orange and black ? A: yes", "what"], ["Q: What color is the bag? A: orange and black", "Q: Is the bag orange and black ? A: yes", "what"], ["Q: What type of boat is in the water? A: ferry", "Q: Is the ferry in the water ? A: yes", "what"], ["Q: How long is the grass? A: medium", "Q: Is the grass medium long? A: yes", "N/A"], ["Q: Is the dog wearing glasses? A: no", "Q: Is the dog not wearing glasses? A: yes", "N/A"], ["Q: What is this? A: snowboard", "Q: Is this a snowboard ? A: yes", "what"], ["Q: What kind of court is the man on? A: tennis court", "Q: Is the man on a tennis court ? A: yes", "what"], ["Q: What type of emergency would this be used for? A: fire", "Q: Would this be used for a fire emergency? A: yes", "what"], ["Q: What kind of cereal appears to be on the donuts to the right? A: none", "Q: Does none appear to be on the donuts to the right? A: yes", "what"], ["Q: Who do you think will win this match? A: white", "Q: Do you think white will win this match? A: yes", "N/A"], ["Q: What color are the tall buildings in the back right? A: glass", "Q: Are the tall buildings in the back right glass ? A: yes", "what"], ["Q: What does the green colored stuffed animal have written on its side? A: susp", "Q: Does the green colored stuffed animal have written susp on its side? A: yes", "what"], ["Q: Where is this? A: little rock", "Q: Is this at a little rock ? A: yes", "where"], ["Q: How many cows are there? A: 6", "Q: Are there 6 cows ? A: yes", "yeseqcount"], ["Q: What is the headboard made of? A: pillows", "Q: Is the headboard made of pillows ? A: yes", "what"], ["Q: Is the clock a free-standing structure? A: no", "Q: Is the clock not a free-standing structure? A: yes", "N/A"], ["Q: What is the white object in the man's hands? A: game controller", "Q: Is the white object in the man 's hands game controller ? A: yes", "what"], ["Q: How many doors in this scene? A: 4", "Q: Are there 4 doors in this scene ? A: yes", "yeseqcount"], ["Q: What color are the uniforms? A: blue", "Q: Are the uniforms blue ? A: yes", "what"], ["Q: How many people are on this car? A: 4", "Q: Are there 4 people on this car? A: yes", "yeseqcount"], ["Q: What color is her belt? A: tan", "Q: Is her belt tan ? A: yes", "what"], ["Q: Did the lady shave her legs this morning? A: probably", "Q: Did the lady probably shave her legs this morning? A: yes", "N/A"], ["Q: What are the girls holding? A: tennis rackets", "Q: Are the girls holding tennis rackets ? A: yes", "what"], ["Q: What game are this people playing? A: wii fitness", "Q: Are this people playing wii fitness ? A: yes", "what"], ["Q: What number of objects are on this scene? A: 8", "Q: Are there 8 objects on this scene ? A: yes", "what"], ["Q: What kind of food is that? A: chinese", "Q: Is that a chinese food? A: yes", "what"], ["Q: Where is the light at? A: pole", "Q: Is the light at the pole ? A: yes", "where"], ["Q: What is going by on the tracks? A: train", "Q: Is the train going by on the tracks ? A: yes", "what"], ["Q: What color are the center marks in this road? A: white", "Q: Are the center marks in this road white ? A: yes", "what"], ["Q: What color is the  vegetables? A: green", "Q: Is the vegetables green ? A: yes", "what"], ["Q: What kind of clock is in the middle of the street? A: standing", "Q: Is there a standing clock in the middle of the street ? A: yes", "what"], ["Q: What one adjective would you use to describe the two items near the keyboard? A: messy", "Q: Would you use messy to describe the two items near the keyboard? A: yes", "what"], ["Q: What color is the frosting? A: blue white and orange", "Q: Is the frosting blue white and orange ? A: yes", "what"], ["Q: What color chair is the man sitting on? A: orange and white", "Q: Is the man sitting on the orange and white ? A: yes", "what"], ["Q: Where are the birds? A: sand", "Q: Are the birds in the sand ? A: yes", "where"], ["Q: What color is the cabinet? A: yellow", "Q: Is the cabinet yellow ? A: yes", "what"], ["Q: What pattern in the brickwork? A: structured", "Q: Is the brickwork structured? A: yes", "N/A"], ["Q: What type of flowers are these? A: purple daisies", "Q: Are these purple daisies ? A: yes", "what"], ["Q: What colors are the woman's shirt? A: green and white", "Q: Are the woman 's shirt green and white ? A: yes", "what"], ["Q: What is the pattern on the cover? A: quilted", "Q: Is the pattern on the cover quilted ? A: yes", "what"], ["Q: What time does the clock say? A: not given", "Q: Does the clock not say the time? A: yes", "what"], ["Q: Where is the passport? A: left of pie", "Q: Is the passport on the left of the pie ? A: yes", "where"], ["Q: What color shirt is the most common? A: brown", "Q: Is the most common skirt brown ? A: yes", "what"], ["Q: What is sticking out of the skiers backpack? A: water bottle", "Q: Is the water bottle sticking out of the skiers backpack ? A: yes", "what"], ["Q: What purpose is this vehicle used for? A: for war", "Q: Is this vehicle used for for war ? A: yes", "what"], ["Q: What is the desktop photo on the right? A: woman", "Q: Is the desktop photo on the right a woman ? A: yes", "what"], ["Q: What are those guitars for? A: playing music", "Q: Are those guitars for playing music ? A: yes", "what"], ["Q: Where are the trains going? A: downtown", "Q: Are the trains going in downtown ? A: yes", "where"], ["Q: What is the man carrying on the bus? A: horn", "Q: Is the man carrying horn on the bus? A: yes", "what"], ["Q: What color are the cups? A: white red", "Q: Are the cups white red ? A: yes", "what"], ["Q: What color is the bike? A: blue and silver", "Q: Is the bike blue and silver ? A: yes", "what"], ["Q: Where is this taken? A: outdoors", "Q: Is this taken outdoors ? A: yes", "where"], ["Q: What color is the first skiers jacket? A: fuchsia", "Q: Is the first skiers jacket fuchsia ? A: yes", "what"], ["Q: Is this in the evening? A: no", "Q: Is this not in the evening? A: yes", "N/A"], ["Q: What court is this? A: food stand", "Q: Is this food stand ? A: yes", "what"], ["Q: What brand is the monitor? A: apple", "Q: Is the monitor an apple ? A: yes", "what"], ["Q: What  \"Over the Rainbow\" singer sang about this vehicle? A: don't know", "Q: Sang about this vehicle don't know ? A: yes", "what"], ["Q: Why is the woman wearing glasses? A: glare protection", "Q: Why is the woman wearing glasses for glare protection? A: yes", "N/A"], ["Q: What are the blue letters on the right? A: h2", "Q: Are the blue letters on the right h2 ? A: yes", "what"], ["Q: How many vehicles are in the street? A: 2", "Q: Are 2 vehicles in the street? A: yes", "yeseqcount"], ["Q: What color are the chairs? A: bright blue", "Q: Are the chairs bright blue ? A: yes", "what"], ["Q: Where are the donuts? A: assembly line", "Q: Are the donuts in assembly line ? A: yes", "where"], ["Q: Is the cat eating? A: no", "Q: Is the cat not eating? A: yes", "N/A"], ["Q: How many cows are in the picture? A: 7", "Q: Are there 7 cows in the picture? A: yes", "yeseqcount"], ["Q: Is there any color in this bathroom? A: white", "Q: Is there white color in this bathroom? A: yes", "N/A"], ["Q: Is this food considered healthy? A: no", "Q: Is this food considered not healthy? A: yes", "N/A"], ["Q: Is this a drug dealers house? A: no", "Q: Is this not a drug dealers house? A: yes", "N/A"], ["Q: Why are there many bikes? A: bike show", "Q: Is there a bike show? A: yes", "N/A"], ["Q: Does the kid like playing this sport? A: yes", "N/A", "N/A"], ["Q: Which hand is the person using to hold the knife's handle? A: left", "Q: Is the person using left hand to hold the knife's handle? A: yes", "N/A"], ["Q: What is on the woman's head? A: toboggan", "Q: Is the toboggan on the woman 's head ? A: yes", "what"], ["Q: How did this person likely hurt their thumb? A: cutting", "Q: Did this person likely cutting their thumb? A: yes", "N/A"], ["Q: Why the piggy back? A: refuel", "Q: Is the piggy back to refuel? A: yes", "N/A"], ["Q: Are the guy and gal acknowledging one another? A: little", "N/A", "N/A"], ["Q: What is the man dragging? A: sledged", "Q: Is the man dragging sledged ? A: yes", "what"], ["Q: What century was this structure built during? A: 18th century", "Q: Was this structure built during 18th century ? A: yes", "what"], ["Q: Which fruit can be seen on the table? A: apple", "Q: Can apple be seen on the table? A: yes", "N/A"], ["Q: How many giraffes are in this scene? A: 1", "Q: Is there 1 giraffe in this scene? A: yes", "yeseqcount"], ["Q: How many umbrellas are red? A: 1", "Q: Is there 1 umbrella red? A: yes", "yeseqcount"], ["Q: What is the animal's nose called? A: mouth", "Q: Is the animal 's nose called mouth ? A: yes", "what"], ["Q: Are the scissors open or closed? A: closed", "Q: Are the scissors closed ? A: yes", "xory_yes"], ["Q: Does the hand look like an adults? A: yes", "N/A", "N/A"], ["Q: Are the horse saddled, ready to ride? A: yes", "N/A", "N/A"], ["Q: Which person is wearing athletic shoes? A: in back", "Q: Is person in back wearing athletic shoes? A: yes", "N/A"], ["Q: What is the purpose of the red item? A: fire hydrant", "Q: Is the purpose of the red item the fire hydrant ? A: yes", "what"], ["Q: What color is the stop light? A: yellow", "Q: Is the stop light yellow ? A: yes", "what"], ["Q: What is the girl in the picture doing? A: playing soccer", "Q: Is the girl in the picture playing soccer ? A: yes", "what"], ["Q: What kind of motorcycle? A: honda", "Q: Is the motorcycle honda? A: yes", "N/A"], ["Q: Why does the vehicle have two mirrors? A: vision", "Q: Does the vehicle have two mirrors for vision? A: yes", "N/A"], ["Q: What percentage of pizza is gone? A: 1/2", "Q: Is the 1/2 of pizza gone ? A: yes", "what"], ["Q: What type of meat is on the pan? A: cake", "Q: Is the cake on the pan ? A: yes", "what"], ["Q: What is the green vegetable on the left? A: lime", "Q: Is the green vegetable on the left lime ? A: yes", "what"], ["Q: What is she eating? A: pie", "Q: Is she eating a pie ? A: yes", "what"], ["Q: Where is the teddy bear?? A: top of trash can", "Q: Is the teddy bear at the top of the trash can ? A: yes", "where"], ["Q: Is the fruit cut up? A: no", "Q: Is the fruit not cut up? A: yes", "N/A"], ["Q: What type of flowers are on the counter? A: orchids", "Q: Are the orchids on the counter ? A: yes", "what"], ["Q: What kind of flowers are here? A: white with yellow center", "Q: Are here white with yellow center ? A: yes", "what"], ["Q: What mode of transportation is being used? A: truck", "Q: Is the truck being used ? A: yes", "what"], ["Q: What does the sign in the background most likely say? A: bebe", "Q: Does the sign in the background most likely say bebe ? A: yes", "what"], ["Q: Where is the blue backpack? A: on his back", "Q: Is the blue backpack on his back ? A: yes", "where"], ["Q: What type of shoes is the player wearing? A: sneakers", "Q: Is the player wearing sneakers ? A: yes", "what"], ["Q: What is the color of the border on the building? A: stone", "Q: Is the color of the border on the building stone ? A: yes", "what"], ["Q: What kind of event is happening? A: protest", "Q: Is a protest happening ? A: yes", "what"], ["Q: How can you tell that someone owns this dog? A: leash", "Q: Can you tell that someone owns this dog by leash? A: yes", "N/A"], ["Q: What surface is the bathroom floor? A: tile", "Q: Is the bathroom floor tile ? A: yes", "what"], ["Q: What type of water is in the bottle? A: mineral water", "Q: Is the mineral water in the bottle ? A: yes", "what"], ["Q: What color is the child's coat? A: multicolored", "Q: Is the child 's coat multicolored ? A: yes", "what"], ["Q: What kind of station is this? A: train", "Q: Is this a train ? A: yes", "what"], ["Q: What is the man in the picture doing? A: directing airplanes", "Q: Is the man in the picture directing airplanes ? A: yes", "what"], ["Q: What material is the hood for the range made of? A: metal", "Q: Is the hood for the range made of metal ? A: yes", "what"], ["Q: How many piercings does she have? A: 1", "Q: Does she have 1 piercing? A: yes", "yeseqcount"], ["Q: Why is she laughing? A: video game", "Q: Is she laughing for the video game? A: yes", "N/A"], ["Q: What kind of truck is this? A: chevrolet", "Q: Is this a chevrolet ? A: yes", "what"], ["Q: What color is the desk? A: no desk", "Q: Is there no desk ? A: yes", "what"], ["Q: Is the cat having a party? A: no", "Q: Is the cat not having a party? A: yes", "N/A"], ["Q: What color is the motorcycle seat? A: black", "Q: Is the motorcycle seat black ? A: yes", "what"], ["Q: What are these men doing? A: dressing", "Q: Are these men dressing ? A: yes", "what"], ["Q: Can this animal really scream? A: don't know", "N/A", "N/A"], ["Q: Are there radishes? A: yes", "N/A", "N/A"], ["Q: Is there a shower curtain? A: yes", "N/A", "N/A"], ["Q: What time of day is it in the picture? A: late afternoon", "Q: Is it late afternoon in the picture ? A: yes", "what"], ["Q: Where is the mixer? A: cupboard", "Q: Is the mixer in the cupboard ? A: yes", "where"], ["Q: What color are the flowers in the vase? A: yellow and black", "Q: Are the flowers in the vase yellow and black ? A: yes", "what"], ["Q: What is this man doing? A: talking on telephone", "Q: Is this man talking on telephone ? A: yes", "what"], ["Q: What vegetable is in the bowl? A: none", "Q: Is the none in the bowl ? A: yes", "what"], ["Q: Whose shadows are on the ground? A: yes", "N/A", "N/A"], ["Q: Are these people playing for fun? A: tennis", "Q: Are these people playing tennis for fun? A: yes", "N/A"], ["Q: What color are the walls the boys are in between? A: eggshell", "Q: Are the walls the boys are in between the eggshell ? A: yes", "what"], ["Q: What red and black object is in the foreground? A: bag", "Q: Is a bag in the foreground ? A: yes", "what"], ["Q: Why is the man above the water? A: parasailing", "Q: Is the man parasailing above the water? A: yes", "N/A"], ["Q: What is the boy holding? A: joystick", "Q: Is the boy holding the joystick ? A: yes", "what"], ["Q: What street is this? A: alameda street", "Q: Is this a alameda street ? A: yes", "what"], ["Q: How many toes are in the picture? A: 75", "Q: Are there 75 toes in the picture? A: yes", "yeseqcount"], ["Q: How many rails do you see? A: 6", "Q: Do you see 6 rails? A: yes", "yeseqcount"], ["Q: Is the girl preparing something? A: yes", "N/A", "N/A"], ["Q: What is on the yellow plate? A: cake", "Q: Is the cake on the yellow plate ? A: yes", "what"], ["Q: What is the person on top skating off of? A: railing", "Q: Is the person on top skating off of the railing ? A: yes", "what"], ["Q: What has long legs? A: stork", "Q: Does stork have long legs? A: yes", "what"], ["Q: Is this person mad? A: yes", "N/A", "N/A"], ["Q: What shape is on his chest? A: square", "Q: Is the shape on his chest square? A: yes", "what"], ["Q: Are these scissors old or new? A: neither", "Q: Are these scissors neither old nor new? A: yes", "N/A"], ["Q: What color is the bedspread? A: off white", "Q: Is the bedspread off white ? A: yes", "what"], ["Q: What brand is the racquet? A: not sure", "Q: Is the racquet's brand not sure ? A: yes", "what"], ["Q: What is in the bottom right bowl? A: yams", "Q: Are the yams in the bottom right bowl ? A: yes", "what"], ["Q: What color are the birds? A: multi-color", "Q: Are the birds multi-color ? A: yes", "what"], ["Q: What are the two main colors of the bus? A: blue and cream", "Q: Are the two main colors of the bus blue and cream ? A: yes", "what"], ["Q: What is he doing? A: watching surfer", "Q: Is he watching surfer ? A: yes", "what"], ["Q: What color is the balloon? A: yellow", "Q: Is the balloon yellow ? A: yes", "what"], ["Q: Is this in the countryside? A: no", "Q: Is this not in the countryside? A: yes", "N/A"], ["Q: Is there a backpack? A: yes", "N/A", "N/A"], ["Q: What color is the sky today? A: gray", "Q: Is the sky today gray ? A: yes", "what"], ["Q: Is the bird trying to avoid the other animal? A: no", "Q: Is the bird not trying to avoid the other animal? A: yes", "N/A"], ["Q: What is the man cooking? A: no", "Q: Is the man cooking no ? A: yes", "what"], ["Q: Who is standing behind the catcher? A: no one", "Q: Is no one standing behind the catcher? A: yes", "N/A"], ["Q: What kind car? A: ford sedan", "Q: is the car ford sedan? A: yes", "N/A"], ["Q: Where did the street get it's name? A: balloon museum", "Q: Did the street get it's name balloon museum ? A: yes", "where"], ["Q: What color are the people's shirts? A: yellow", "Q: Are the people 's shirts yellow ? A: yes", "what"], ["Q: Where is the flag? A: ortho", "Q: Is the flag at ortho ? A: yes", "where"], ["Q: What kind of trees are there? A: pines", "Q: Are there pines ? A: yes", "what"], ["Q: Is the dog touching the ground? A: no", "Q: Is the dog not touching the ground? A: yes", "N/A"], ["Q: What utensil is with the pizza? A: pizza cutter", "Q: Is the pizza cutter with the pizza ? A: yes", "what"], ["Q: What is the most likely reason as to why this guy is laid out on the ground? A: he isn't", "Q: Isn't this guy laid out on the ground? A: yes", "what"], ["Q: How much clearance is there? A: 20 feet", "Q: Is there 20 feed clearance? A: yes", "N/A"], ["Q: What are they using to row? A: oars", "Q: Are they using to row oars ? A: yes", "what"], ["Q: What are these men playing? A: music", "Q: Are these men playing a music ? A: yes", "what"], ["Q: Is the bamboo on the right completely straight? A: yes", "N/A", "N/A"], ["Q: Is the brickwork shaped like many church windows? A: no", "Q: Is the brickwork not shaped like many church windows? A: yes", "N/A"], ["Q: Where is the cat sleeping? A: under shelf", "Q: Is the cat sleeping under the shelf ? A: yes", "where"], ["Q: Is there an owner in the photo? A: yes", "N/A", "N/A"], ["Q: Is the propeller of the plane moving? A: yes", "N/A", "N/A"], ["Q: Is there anyone on the water? A: no", "Q: Is there no one on the water? A: yes", "N/A"], ["Q: What time was this picture taken? A: old", "Q: Was this picture taken old ? A: yes", "what"], ["Q: What are the knobby things on top of their heads called? A: osceones", "Q: Are the knobby things on top of their heads called osceones? A: yes", "what"], ["Q: What does the bottom sign say? A: pending", "Q: Does the bottom sign say pending ? A: yes", "what"], ["Q: Where is the head of the giraffe on the left? A: over fence", "Q: Is the head of the giraffe on the left over the fence ? A: yes", "where"], ["Q: What is under the broccoli? A: pizza", "Q: Is the pizza under the broccoli ? A: yes", "what"], ["Q: How close is the boy to the net? A: not very", "Q: Is the boy not very close to the net? A: yes", "N/A"], ["Q: What is in the glass? A: sangria", "Q: Is the sangria in the glass ? A: yes", "what"], ["Q: Is a clock useful in a kitchen? A: no", "Q: Is a clock not useful in a kitchen? A: yes", "N/A"], ["Q: What number is on his shirt? A: 2", "Q: Is the 2 on his shirt ? A: yes", "what"], ["Q: Are they all going to board a train? A: yes", "N/A", "N/A"], ["Q: How many humans on the beach? A: 4", "Q: Are there 4 humans on the beach ? A: yes", "yeseqcount"], ["Q: What is on the bench? A: cups", "Q: Are the cups on the bench ? A: yes", "what"], ["Q: How many bicycles? A: 3", "Q: Are there 3 bicycles ? A: yes", "yeseqcount"], ["Q: Is there something about this shot reminiscent of the old \"his master's voice\" ads? A: what?", "N/A", "N/A"], ["Q: What is the dog doing? A: biting frisbee", "Q: Is the dog biting frisbee ? A: yes", "what"], ["Q: What kind of food is this? A: torta", "Q: Is this a torta ? A: yes", "what"], ["Q: What is the color of the hydrant? A: yellow", "Q: Is the color of the hydrant yellow ? A: yes", "what"], ["Q: What are the lines on the ground for? A: tracks", "Q: Are the lines on the ground for the tracks ? A: yes", "what"], ["Q: Why does this woman look relaxed? A: yes", "N/A", "N/A"], ["Q: What is behind the animals? A: fence", "Q: Is the fence behind the animals ? A: yes", "what"], ["Q: Is there anyplace to sit? A: yes", "N/A", "N/A"], ["Q: How many dogs? A: ibid", "N/A", "N/A"], ["Q: Is there a jogger on the trail? A: yes", "N/A", "N/A"], ["Q: How many elephants are in danger of being hit? A: 2", "Q: Are 2 elephants in danger of being hit? A: yes", "yeseqcount"], ["Q: Are the waters smooth or choppy? A: smooth", "Q: Are the waters smooth ? A: yes", "xory_yes"], ["Q: What is the name of the banana company? A: siam banana company", "Q: Is the name of the banana company siam banana company ? A: yes", "what"], ["Q: What animals are being herded? A: cows", "Q: Are the cows being herded ? A: yes", "what"], ["Q: Is that a yellow train? A: yes", "N/A", "N/A"], ["Q: How is the girl feeling? A: ok", "Q: Is the girl feeling ok? A: yes", "N/A"], ["Q: Are there any juvenile giraffes in this picture? A: yes", "N/A", "N/A"], ["Q: How has this picture been altered? A: photo filter", "Q: Has this picture been altered by photo filter? A: yes", "N/A"], ["Q: What matches with the woman's hat? A: boots", "Q: Do boots match with the woman 's hat? A: yes", "what"], ["Q: What is the green object on the left side of the computer screen? A: cartoon character", "Q: Is the green object on the left side of the computer screen cartoon character ? A: yes", "what"], ["Q: What is the symbol at the back of the plane? A: wavy lines", "Q: Is the symbol at the back of the plane wavy lines ? A: yes", "what"], ["Q: In what country was the photograph taken? A: germany", "Q: Was the photograph taken in germany? A: yes", "N/A"], ["Q: Do the white designs on the laptop and pink pot holder match? A: no", "Q: Do the white designs on the laptop not match the pink pot holder? A: yes", "N/A"], ["Q: What is the street that the car is driving on? A: easy street", "Q: Is the street that the car is driving on an easy street ? A: yes", "what"], ["Q: What kind of place are the people in? A: skateboard park", "Q: Are the people in a skateboard park ? A: yes", "what"], ["Q: What color is the middle man's socks? A: black", "Q: Is the middle man 's socks black ? A: yes", "what"], ["Q: What size wave is the surfer riding? A: medium sized wave", "Q: Is the surfer riding medium sized wave ? A: yes", "what"], ["Q: What is the dark object on the left? A: pier", "Q: Is the dark object on the left a pier ? A: yes", "what"], ["Q: What is the number on the bench? A: 83", "Q: Is the number on the bench 83 ? A: yes", "what"], ["Q: What design is the shower curtain? A: mosaic", "Q: Is the shower curtain mosaic ? A: yes", "what"], ["Q: What is under the bananas? A: cake", "Q: Is the cake under the bananas ? A: yes", "what"], ["Q: Is this electronic? A: yes", "N/A", "N/A"], ["Q: Is the store busy? A: yes", "N/A", "N/A"], ["Q: What type of vehicle is sitting between the bus and the truck? A: honda", "Q: Is the honda sitting between the bus and the truck ? A: yes", "what"], ["Q: What is the sum of the digits on either end of the sign in the corner? A: no sign", "Q: Is the sum of the digits on either end of the sign in the corner no sign ? A: yes", "what"], ["Q: How many white sheep are there? A: many", "Q: Are there many white sheep? A: yes", "N/A"], ["Q: What color is the table? A: not shown", "Q: Is the table not shown ? A: yes", "what"], ["Q: How many cars on truck? A: many", "Q: Are there many cars on truck? A: yes", "N/A"], ["Q: How many people are there in the stands? A: 40", "Q: Are there 40 people in the stands? A: yes", "yeseqcount"], ["Q: What type of boat is in the water? A: bumper", "Q: Is the bumper in the water ? A: yes", "what"], ["Q: Does this animal have claws? A: no", "Q: Does this animal not have claws? A: yes", "N/A"], ["Q: Were there children on this flight? A: airplane", "N/A", "N/A"], ["Q: What time is it? A: 4:50", "Q: Is it 4:50 ? A: yes", "what"], ["Q: How old is the longest serving Air Force aircraft? A: 20", "Q: Is the longest serving Air Force aircraft 20 years old? A: yes", "N/A"], ["Q: What section of a grocery store would you find these items? A: produce", "Q: Would you find these items in produce section of a grocery store ? A: yes", "what"], ["Q: Is there a remote control on the desk? A: yes", "N/A", "N/A"], ["Q: Are they at a store, a zoo or a concert? A: zoo", "Q: Are they at a zoo ? A: yes", "xory_yes"], ["Q: What object is nearest the camera? A: tree", "Q: Is the tree nearest the camera ? A: yes", "what"], ["Q: What color is the girl's shirt? A: pink and yellow", "Q: Is the girl 's shirt pink and yellow ? A: yes", "what"], ["Q: What is the image on the kite? A: skull and crossbones", "Q: Is the image on the kite skull and crossbones ? A: yes", "what"], ["Q: What kind of automobile is shown? A: car", "Q: Is the car shown ? A: yes", "what"], ["Q: What brand is this girl's shirt? A: oc", "Q: Is this girl 's shirt oc ? A: yes", "what"], ["Q: What are the women about to eat? A: dinner", "Q: Are the women about to eat dinner ? A: yes", "what"], ["Q: What are these people riding on? A: wagon", "Q: Are these people riding on the wagon ? A: yes", "what"], ["Q: Are this men's ties? A: on display racks", "N/A", "N/A"], ["Q: What are these signs saying? A: graffiti", "Q: Are these signs saying graffiti ? A: yes", "what"], ["Q: What kind of court is this? A: hard", "Q: Is this kind of court hard? A: yes", "what"], ["Q: Why is the ground wet? A: water hydrant leaking", "Q: Is the ground wet because of water hydrant leaking? A: yes", "N/A"], ["Q: What type of finish does oven have? A: stainless", "Q: Does have stainless oven ? A: yes", "what"], ["Q: What direction is the ball traveling? A: away from pitcher", "Q: Is the ball traveling away from pitcher ? A: yes", "what"], ["Q: What is the function of the wooden structure among the flowers? A: flower box", "Q: Is the function of the wooden structure among the flowers flower box ? A: yes", "what"], ["Q: What numbers are showing on the clocks? A: 3, 6, 9 and 12", "Q: Are the 3, 6, 9 and 12 showing on the clocks ? A: yes", "what"], ["Q: What was the cake made to look like? A: tower", "Q: Was the cake made to look like a tower ? A: yes", "what"], ["Q: What kind of cup is near the mouse? A: coffee cup", "Q: Is the coffee cup near the mouse ? A: yes", "what"], ["Q: Pattern on shirt? A: square", "Q: Is the pattern on shirt square? A: yes", "N/A"], ["Q: What is pushing the board? A: paddle by person", "Q: Is the paddle by person pushing the board ? A: yes", "what"], ["Q: Where are the towels? A: on top shelf", "Q: Are the towels on the top shelf ? A: yes", "where"], ["Q: What color is the bedspread? A: red and yellow", "Q: Is the bedspread a red and yellow ? A: yes", "what"], ["Q: Is this globe a lawn ornament? A: yes", "N/A", "N/A"], ["Q: What is the on the bear on the left? A: toy turtle", "Q: Is the toy turtle on the bear on the left ? A: yes", "what"], ["Q: What color is the bat? A: black, tan", "Q: Is the bat black, tan ? A: yes", "what"], ["Q: What are the policemen doing? A: riding", "Q: Are the policemen riding ? A: yes", "what"], ["Q: What are the children cheering for? A: peace", "Q: Are the children cheering for a peace ? A: yes", "what"], ["Q: What time is it on the clock? A: 8", "Q: Is it 8 on the clock ? A: yes", "what"], ["Q: How fast is this boat going? A: 10 mph", "Q: Is this boat going 10 mph? A: yes", "N/A"], ["Q: What is the difference between these two donuts? A: one is plain", "Q: Is the difference between these two donuts one is plain ? A: yes", "what"], ["Q: Are there passengers on the bus? A: no", "Q: Are there passengers not on the bus? A: yes", "N/A"], ["Q: What is the color of the border on the building? A: gray", "Q: Is the color of the border on the building gray ? A: yes", "what"], ["Q: What pattern is the tile floor? A: square", "Q: Is the tile floor square ? A: yes", "what"], ["Q: Which child is using both hands to eat the cake? A: right front", "Q: Is the right front child using both hands to eat the cake? A: yes", "N/A"], ["Q: Which guy is thinner? A: middle", "Q: Is the middle guy thinner? A: yes", "N/A"], ["Q: What type of computer is on the desk? A: samsung", "Q: Is the samsung on the desk ? A: yes", "what"], ["Q: Does this place see heavy foot traffic? A: yes", "N/A", "N/A"], ["Q: Where is the wicker chair? A: living room", "Q: Is the wicker chair in the living room ? A: yes", "where"], ["Q: What's on the burner? A: pot", "Q: Is the pot on the burner ? A: yes", "what"], ["Q: Why are the people standing on a raised platform? A: on roof", "N/A", "N/A"], ["Q: What video game console is in this picture? A: wii", "Q: Is the wii in this picture ? A: yes", "what"], ["Q: What kind of hot dog bun is this? A: unsure", "Q: Is this a unsure kind of hog dog bun? A: yes", "what"], ["Q: How many windows? A: 30", "Q: Are there 30 windows ? A: yes", "yeseqcount"], ["Q: How old is the commode? A: new", "Q: Is the commode new? A: yes", "N/A"], ["Q: What design is pictured on her clothing? A: spider web", "Q: Is the spider web pictured on her clothing ? A: yes", "what"], ["Q: What color are the woman's socks? A: white", "Q: Are the woman 's socks white ? A: yes", "what"], ["Q: Is this a healthy breakfast? A: yes", "N/A", "N/A"], ["Q: What is covering his shirt? A: blazer", "Q: Is the blazer covering his shirt ? A: yes", "what"], ["Q: Where are tongs? A: in plastic container with sliced oranges", "Q: Are tongs in the plastic container with sliced oranges ? A: yes", "where"], ["Q: How many people in total? A: 3", "Q: Are there 3 people in total ? A: yes", "yeseqcount"], ["Q: How many pepperonis are on this pizza? A: 14", "Q: Are 14 pepperonis on this pizza? A: yes", "yeseqcount"], ["Q: How many people are shown? A: 34", "Q: Are 34 people shown? A: yes", "yeseqcount"], ["Q: Does these people look pleased with the taste? A: no", "Q: Does these people look not pleased with the taste? A: yes", "N/A"], ["Q: What is seen behind the tree branches? A: birds", "Q: Are the birds seen behind the tree branches ? A: yes", "what"], ["Q: Does anyone have a tattoo in the photo? A: no", "Q: Does no one have a tattoo in the photo? A: yes", "N/A"], ["Q: What kind of money is this? A: ancient", "Q: Is this the ancient money? A: yes", "what"], ["Q: Why does the dog have a hat on? A: for photo", "Q: Does the dog have a hat on for photo? A: yes", "N/A"], ["Q: How many canisters on shelf? A: lots", "Q: Are there lots of canisters on shelf? A: yes", "N/A"], ["Q: What is the store across the street? A: le dallas", "Q: Is the store across the street le dallas ? A: yes", "what"], ["Q: How many red lights are in this picture? A: 2", "Q: Are 2 red lights in this picture? A: yes", "yeseqcount"], ["Q: What is this type of animal known to have a very good sense of? A: mice", "Q: Are mice known to have a very good sense of? A: yes", "what"], ["Q: How old is this elephant? A: 20", "Q: Is this elephant 20 years old? A: yes", "N/A"], ["Q: What pattern is on the man's tie? A: dots", "Q: Are dots on the man 's tie ? A: yes", "what"], ["Q: What letters is on the train? A: a, b, l, n, s, v", "Q: Is the a, b, l, n, s, v on the train ? A: yes", "what"], ["Q: What is on the hot dogs? A: beeg", "Q: Are the beeg on the hot dogs ? A: yes", "what"], ["Q: How deep is the water? A: 30 feet", "Q: Is the water 30 feet deep? A: yes", "N/A"], ["Q: Where is the trainer potty? A: lower left", "Q: Is the trainer potty in the lower left ? A: yes", "where"], ["Q: What is the dog standing next to? A: toilet", "Q: Is the dog standing next to the toilet ? A: yes", "what"], ["Q: What is the sign saying? A: stop, don't walk", "Q: Is the sign saying stop, don't walk? A: yes", "N/A"], ["Q: What brand is the green shirt? A: polo", "Q: Is the green shirt polo ? A: yes", "what"], ["Q: What is on the girl's head? A: mask", "Q: Is the mask on the girl 's head ? A: yes", "what"], ["Q: What is in the distance? A: arrow sign", "Q: Is the arrow sign in the distance ? A: yes", "what"], ["Q: What is the dog thinking? A: he is hungry", "Q: Is the dog thinking he is hungry ? A: yes", "what"], ["Q: Does the picture show a man or a woman? A: man", "Q: Does the picture show a man? A: yes", "N/A"], ["Q: What kind of chair is next to the couch? A: love seat", "Q: Is a love seat next to the couch ? A: yes", "what"], ["Q: How many objects are in the picture? A: 6", "Q: Are 6 objects in the picture? A: yes", "yeseqcount"], ["Q: What animals are on the field? A: sheep and cows", "Q: Are the sheep and cows on the field ? A: yes", "what"], ["Q: What is the cost for one of those desserts? A: 3.00", "Q: Is the cost for one of those desserts 3.00 ? A: yes", "what"], ["Q: Where is the hydrant? A: buried in snow", "Q: Is the hydrant buried in the snow ? A: yes", "where"], ["Q: What color is the speed limit sign? A: not visible", "Q: Is the color of the speed limit sign not visible ? A: yes", "what"], ["Q: What kind of fencing seen? A: metal", "Q: The metal seen ? A: yes", "what"], ["Q: What is the person doing with a tire? A: changing tire", "Q: is the person changing tire? A: yes", "what"], ["Q: How many sheep are in the field? A: 13", "Q: Are 13 sheep in the field? A: yes", "yeseqcount"], ["Q: What time does the clock on the right say? A: 7 45", "Q: Does the clock on the right say 7 45 ? A: yes", "what"], ["Q: Which jacket is not black? A: leftmost", "Q: Is the leftmost jacket not black? A: yes", "N/A"], ["Q: Are there deciduous and evergreen trees in the picture? A: yes", "N/A", "N/A"], ["Q: What kind of creature is carved in the stone next to the little boy? A: dolphin", "Q: Is dolphin carved in the stone next to the little boy ? A: yes", "what"], ["Q: What sits on the window frame? A: vases", "Q: Do vases sit on the window frame? A: yes", "what"], ["Q: What color is this kids skin? A: beige", "Q: Is this kids skin beige ? A: yes", "what"], ["Q: What object is partly covered by the bottle labels? A: plate", "Q: Is plate partly covered by the bottle labels ? A: yes", "what"], ["Q: What material is the hood for the range made of? A: glass", "Q: Is the hood for the range made of glass ? A: yes", "what"], ["Q: Is the woman sleeping? A: yes", "N/A", "N/A"], ["Q: What sport is this child practicing for? A: unanswerable", "Q: Is this child practicing for unanswerable ? A: yes", "what"], ["Q: What the bricks in the background painted in different colors? A: wall", "Q: The bricks in the background painted in different colors wall ? A: yes", "what"], ["Q: Besides the boats, what else is in the water? A: waves", "N/A", "N/A"], ["Q: What object is on the flag? A: red", "Q: Is the red on the flag ? A: yes", "what"], ["Q: What is the climate like? A: hot and humid", "Q: Is the climate like hot and humid ? A: yes", "what"], ["Q: What color is the building with a clock at the top? A: tan", "Q: Is the building with a clock at the top tan ? A: yes", "what"], ["Q: How high into the air is the plane? A: 45 ft", "Q: Is the plane 45 ft into the air? A: yes", "N/A"], ["Q: What was the cat standing on? A: dresser", "Q: Was the cat standing on the dresser ? A: yes", "what"], ["Q: What color shirts are the boys wearing? A: blue", "Q: Are the boys wearing blue ? A: yes", "what"], ["Q: What colors is the bus? A: red, white, black", "Q: Is the bus red, white, black ? A: yes", "what"], ["Q: What shape formation are the birds flying in? A: scatter", "Q: Are the birds flying in scatter ? A: yes", "what"], ["Q: What shape is the couch? A: l", "Q: Is the couch l ? A: yes", "what"], ["Q: What color is the paper? A: red", "Q: Is the paper red ? A: yes", "what"], ["Q: What color is the top? A: tan", "Q: Is the top tan ? A: yes", "what"], ["Q: What event does this photo promote? A: healthy eating", "Q: Does this photo promote healthy eating ? A: yes", "what"], ["Q: What car brand is in the photo? A: mercedes", "Q: Is the car brand mercedes in the photo ? A: yes", "what"], ["Q: How many people are waiting on the platform? A: 1", "Q: Is 1 person waiting on the platform? A: yes", "yeseqcount"], ["Q: What profession use these tools? A: it", "Q: It use these tools ? A: yes", "what"], ["Q: What kind of Jersey is he wearing? A: sports", "Q: Is he wearing a sports Jersay? A: yes", "what"], ["Q: Does the woman in the front look happy? A: yes", "N/A", "N/A"], ["Q: What type of room is this? A: classroom", "Q: Is this a classroom ? A: yes", "what"], ["Q: What is the pizza made of? A: dough, cheese, sauce and spinach", "Q: Is the pizza made of dough, cheese, sauce and spinach ? A: yes", "what"], ["Q: What time was this photo taken? A: 320", "Q: Was this photo taken 320 ? A: yes", "what"], ["Q: How many tall windows are in view? A: 3", "Q: Are there 3 tall windows in view? A: yes", "yeseqcount"], ["Q: How many baby giraffes are there? A: 1", "Q: Is there 1 baby giraffe ? A: yes", "yeseqcount"], ["Q: What is on the bottom of this plane? A: pontoons (or floats)", "Q: Are the pontoons (or floats) on the bottom of this plane ? A: yes", "what"], ["Q: What color are the floor tiles? A: green", "Q: Are the floor tiles green ? A: yes", "what"], ["Q: What color is the bench? A: worn wood", "Q: Is the bench worn wood ? A: yes", "what"], ["Q: What is the red vegetable? A: red pepper", "Q: Is the red vegetable red pepper ? A: yes", "what"], ["Q: What time is on the clock? A: 2:23", "Q: Is the time 2:23 on the clock ? A: yes", "what"], ["Q: How is the girl's hair styled? A: long", "Q: Is the girl's hair styled long? A: yes", "N/A"], ["Q: Is that a desktop computer? A: yes", "N/A", "N/A"], ["Q: What color is the dog's fur? A: tan", "Q: Is the dog 's fur tan ? A: yes", "what"], ["Q: Why is he clapping? A: for fun", "Q: Is he clapping for fun? A: yes", "N/A"], ["Q: What is he making? A: desert", "Q: Is he making a desert ? A: yes", "what"], ["Q: Is that a reclining chair? A: no", "Q: Is that not a reclining chair? A: yes", "N/A"], ["Q: What color is the tag on the bottle? A: obits", "Q: Is the tag on the bottle obits ? A: yes", "what"], ["Q: Are there any baby animals? A: no", "Q: Are there not any baby animals? A: yes", "N/A"], ["Q: What time is it in the picture? A: noon", "Q: Is the time noon in the picture ? A: yes", "what"], ["Q: What action of the water allows the person to lift into the air? A: nothing", "Q: Does no action of the water allow the person to lift into the air? A: yes", "what"], ["Q: What company is advertised on the wall? A: cyclones", "Q: Are the cyclones advertised on the wall ? A: yes", "what"], ["Q: What animals are  pictured? A: elephants", "Q: Are elephants pictured? A: yes", "what"], ["Q: Was this pic taken during the day? A: no", "Q: Was this pic not taken during the day? A: yes", "N/A"], ["Q: How many kids are in the image? A: 2", "Q: Are there 2 kids in the image? A: yes", "yeseqcount"], ["Q: How deep is snow? A: 1 foot", "Q: Is the snow 1 foot deep? A: yes", "N/A"], ["Q: When was this photo taken? A: spring", "Q: Was this photo taken in spring? A: yes", "N/A"], ["Q: What are the flowers put in? A: rock", "Q: Are the flowers put in the rock ? A: yes", "what"], ["Q: How do you contact someone to get office space? A: 201-509-6900", "Q: Do you contact someone to get office space with 201-509-6900? A: yes", "N/A"], ["Q: What is the man doing to the tie? A: licking it", "Q: Is the man licking the tie? A: yes", "what"], ["Q: Where is the cat in? A: pan", "Q: Is the cat in the pan ? A: yes", "where"], ["Q: Are these paddle boards the same length and weight? A: yes", "N/A", "N/A"], ["Q: What are the last 2 digits behind the man? A: 0", "Q: Are the last 2 digits behind the man 0 ? A: yes", "what"], ["Q: What color is this child's jacket? A: green", "Q: Is this child 's jacket green ? A: yes", "what"], ["Q: What is the woman holding to her head? A: cell phone", "Q: Is the woman holding a cell phone to her head ? A: yes", "what"], ["Q: What is the lady holding in front of her? A: surfboard", "Q: Is the lady holding a surfboard in front of her? A: yes", "what"], ["Q: Did the tennis ball go over the hedge in the lower right picture? A: no", "Q: Did the tennis ball not go over the hedge in the lower right picture? A: yes", "N/A"], ["Q: What is this guy doing? A: smiling", "Q: Is this guy smiling ? A: yes", "what"], ["Q: What is the picture on the monitor? A: windows word", "Q: Is the picture on the monitor windows word ? A: yes", "what"], ["Q: Who slipped the billion dollar sign in there? A: town", "Q: Did town slip the billion dollar sign in there? A: yes", "N/A"], ["Q: Where did term \"big top\" come from? A: barnum & bailey", "Q: Did term \"big top\" come from barnum & bailey ? A: yes", "where"], ["Q: What is the breed of dog in this photo? A: german shepherd", "Q: Is the breed of dog in this photo german shepherd ? A: yes", "what"], ["Q: Where is this establishment located? A: europe", "Q: Is this establishment located in europe ? A: yes", "where"], ["Q: What is she riding on? A: snowmobile", "Q: Is she riding on a snowmobile ? A: yes", "what"], ["Q: What side of the street is the bus parked on? A: right", "Q: Is the bus parked on the right side of the street? A: yes", "what"], ["Q: Why is the door open? A: to take pizza out", "Q: Is the door open to take pizza out? A: yes", "N/A"], ["Q: What is the man standing on top of the ramp? A: skater", "Q: Is a skater standing on top of the ramp ? A: yes", "what"], ["Q: What is on the table? A: toy/finger paintings", "Q: Is the toy/finger paintings on the table ? A: yes", "what"], ["Q: What color is the van? A: black", "Q: Is the van black ? A: yes", "what"], ["Q: What time of day is this? A: 8pm", "Q: Is this 8pm ? A: yes", "what"], ["Q: Why does he have a mask on? A: party", "Q: Does he have a mask on for party? A: yes", "N/A"], ["Q: How many scooters do you see? A: 1", "Q: Do you see 1 scooter? A: yes", "yeseqcount"], ["Q: What is the name of this building? A: gas station", "Q: Is the name of this building a gas station ? A: yes", "what"], ["Q: What is the light colored blob in the center of the microwave door? A: food", "Q: Is the light colored blob food in the center of the microwave door? A: yes", "what"], ["Q: Is the water warm or cold? A: cold", "Q: Is the water cold ? A: yes", "xory_yes"], ["Q: How many different kinds of animals are pictured? A: 3", "Q: Are 3 different kinds of animals pictured? A: yes", "yeseqcount"], ["Q: What is the woman holding in her left hand? A: cell phone", "Q: Is the woman holding a cell phone in her left hand? A: yes", "what"], ["Q: What type of soda are they drinking? A: off brand", "Q: Are they drinking off brand soda? A: yes", "what"], ["Q: What are all these outlets useful for? A: what outlets?", "Q: Are all these outlets useful for what outlets? ? A: yes", "what"], ["Q: What kind of tree is on the right? A: birch", "Q: Is the birch on the right ? A: yes", "what"], ["Q: What are they doing? A: playing on wii", "Q: Are they playing on wii ? A: yes", "what"], ["Q: Where is the keyboard? A: suitcase", "Q: Is the keyboard in the suitcase ? A: yes", "where"], ["Q: How many electronic devices are shown? A: 7", "Q: Are 7 electronic devices shown? A: yes", "yeseqcount"], ["Q: Why is there only some snow on the ground? A: drifting", "N/A", "N/A"], ["Q: Is the tree leaning or straight? A: leaning", "Q: Is the tree leaning ? A: yes", "xory_yes"], ["Q: Why are all the birds white? A: same type of birds", "Q: Are all the white birds same type? A: yes", "N/A"], ["Q: What is this kid playing with? A: scissors", "Q: Is this kid playing with scissors? A: yes", "N/A"], ["Q: How many plants are in this photo? A: 2", "Q: Are there 2 plants in this photo? A: yes", "yeseqcount"], ["Q: How many ears are visible in the picture? A: 4", "Q: Are there 4 ears visible in the picture? A: yes", "yeseqcount"], ["Q: What time is on the clock? A: 6:47", "Q: Is 6:47 on the clock ? A: yes", "what"], ["Q: What is this man doing? A: taking picture brushing teeth", "Q: Is this man taking picture brushing teeth ? A: yes", "what"], ["Q: How many knobs are on the stove? A: 4", "Q: Are there 4 knobs on the stove? A: yes", "yeseqcount"], ["Q: What is the red triangular shape on the ground? A: slalom marker", "Q: Is the red triangular slalom marker on the ground? A: yes", "what"], ["Q: What is directly in front of the camera? A: batter", "Q: Is batter directly in front of the camera ? A: yes", "what"], ["Q: Is there more than one figure in the table? A: no", "Q: Is there not more than one figure in the table? A: yes", "N/A"], ["Q: What type of tracks are in the sand? A: dune buggy", "Q: Are the dune buggy in the sand? A: yes", "what"], ["Q: How is the man wearing his hat? A: down", "Q: Is the man wearing his hat down? A: yes", "N/A"], ["Q: Where is the animal? A: field", "Q: Is the animal in the field ? A: yes", "where"], ["Q: Are the windows big? A: no", "Q: Are the windows not big? A: yes", "N/A"], ["Q: What brand is on the sign? A: coke", "Q: Is the coke on the sign ? A: yes", "what"], ["Q: What is on the plate? A: carrots, chicken", "Q: Are the carrots, chicken on the plate ? A: yes", "what"], ["Q: Is the water crowded? A: yes", "N/A", "N/A"], ["Q: Which animal is farthest back? A: cow", "Q: Is the cow farthest back? A: yes", "N/A"], ["Q: What type of vegetables are green? A: green bean", "Q: Are green bean green? A: yes", "what"], ["Q: What color are their wing tips? A: yellow", "Q: Are their wing tips yellow ? A: yes", "what"], ["Q: What is the lamp on the right for? A: give light", "Q: Is the lamp on the right for giving light ? A: yes", "what"], ["Q: What is hanging from the book shelves against the wall? A: coats", "Q: Are the coats hanging from the book shelves against the wall ? A: yes", "what"], ["Q: What is the color of the birds beak? A: orange", "Q: Is the color of the birds beak orange ? A: yes", "what"], ["Q: Can you eat this? A: yes", "N/A", "N/A"], ["Q: Is this an antique or modern train? A: modern", "Q: Is this an modern train ? A: yes", "xory_yes"], ["Q: How many stop signs are at the intersection? A: 1", "Q: Is there 1 stop sign at the intersection? A: yes", "yeseqcount"], ["Q: Is there a plaque? A: no", "Q: Is there no plaque? A: yes", "N/A"], ["Q: Where is the toilet at? A: old building", "Q: Is the toilet at a old building ? A: yes", "where"], ["Q: What material are the curtains made of? A: sheer", "Q: Are the curtains made of sheer ? A: yes", "what"], ["Q: How many skateboards are shown? A: 3", "Q: Are there 3 skateboards shown? A: yes", "yeseqcount"], ["Q: Do these look like school buses? A: yes", "N/A", "N/A"], ["Q: Is this skateboarder using a busy or quiet sidewalk? A: quiet", "Q: Is this skateboarder using a quiet sidewalk ? A: yes", "xory_yes"], ["Q: What is red? A: apple", "Q: Is apple red? A: yes", "what"], ["Q: Where is the headphones at? A: no headphones", "Q: Is there no headphones ? A: yes", "where"], ["Q: What is in the background? A: best buy", "Q: Is the best buy in the background ? A: yes", "what"], ["Q: What color is the plate? A: red and white", "Q: Is the plate red and white ? A: yes", "what"], ["Q: What is the animal? A: goose", "Q: Is the animal a goose ? A: yes", "what"], ["Q: What type of vegetable is pictured? A: no vegetable", "Q: Is there no vegetable pictured ? A: yes", "what"], ["Q: What does this man's shirt say? A: make poverty history", "Q: Does this man 's shirt say make poverty history ? A: yes", "what"], ["Q: What color is the man's hat? A: brown and black", "Q: Is the man 's hat brown and black ? A: yes", "what"], ["Q: What team does he play for? A: raiders", "Q: Does he play for raiders ? A: yes", "what"], ["Q: What does the sign say? A: \"this tub is for urine only no shit please!\"", "Q: Does the sign say \"this tub is for urine only no shit please!\" ? A: yes", "what"], ["Q: What kind of kite is the man flying? A: one with two handles", "Q: Is the man flying one with two handles kite? A: yes", "what"], ["Q: What color is her shirt? A: yellow and pink", "Q: Is her shirt yellow and pink ? A: yes", "what"], ["Q: What color is the clock face? A: gold and red", "Q: Is the clock face gold and red ? A: yes", "what"], ["Q: What type of bag is this? A: shoulder bag", "Q: Is this a shoulder bag ? A: yes", "what"], ["Q: Where is the computer? A: on floor", "Q: Is the computer on the floor ? A: yes", "where"], ["Q: Why are there no passengers in this train station? A: stopped", "Q: Is this train station stopped? A: yes", "N/A"], ["Q: How do the little boy's shoes stay on his feet? A: tied", "Q: Do the little boy's shoes tied on his feet? A: yes", "N/A"], ["Q: Are they a couple? A: yes", "N/A", "N/A"], ["Q: Where is the horse looking? A: side", "Q: Is the horse looking at the side ? A: yes", "where"], ["Q: How many benches are in the background? A: 5", "Q: Are there 5 benches in the background? A: yes", "yeseqcount"], ["Q: What is in the glass? A: bananas", "Q: Are there bananas in the glass ? A: yes", "what"], ["Q: Where are the dark clouds? A: left corner", "Q: Are the dark clouds in the left corner ? A: yes", "where"], ["Q: What is the scene? A: forest scenery", "Q: Is the scene a forest scenery ? A: yes", "what"], ["Q: What's the building made of? A: white", "Q: Is the building made of white ? A: yes", "what"], ["Q: Whose holding the umbrella? A: female with black hair", "Q: Is a female with black hair holding the umbrella? A: yes", "N/A"], ["Q: Is this a full house at the stadium? A: yes", "N/A", "N/A"], ["Q: Where is the window? A: on far wall", "Q: Is the window on the far wall ? A: yes", "where"], ["Q: What is the bird on? A: leaf", "Q: Is the bird on the leaf ? A: yes", "what"], ["Q: Is the bike tied to the bench? A: no", "Q: Is the bike not tied to the bench? A: yes", "N/A"], ["Q: Which steer has antlers shape like that of a devil? A: one closest to camera", "Q: Does the steer closest to camera have antlers shape like that of a devil? A: yes", "N/A"], ["Q: What type of train is in this picture? A: metro", "Q: Is the metro in this picture ? A: yes", "what"], ["Q: What is the name on the banner? A: chrome", "Q: Is the name on the banner chrome ? A: yes", "what"], ["Q: What color is preventable? A: all colors are", "Q: Are all colors preventable ? A: yes", "what"], ["Q: Is the cat scared of someone? A: yes", "N/A", "N/A"], ["Q: What colors are the umbrellas? A: red and white", "Q: Are the umbrellas red and white ? A: yes", "what"], ["Q: What does she have in her hair? A: rubber band", "Q: Does she have rubber band  in her hair? A: yes", "what"], ["Q: What is white in the sky? A: frisbee", "Q: Is a white frisbee in the sky? A: yes", "what"], ["Q: Is the vehicle closer to the viewer larger than the vehicle in the background? A: yes", "N/A", "N/A"], ["Q: Did the batter hit the ball? A: maybe", "N/A", "N/A"], ["Q: What company made this machine? A: kenmore", "Q: Kenmore made this machine ? A: yes", "what"], ["Q: Will she try and juggle the apples? A: no", "Q: Will she not try and juggle the apples? A: yes", "N/A"], ["Q: What time does the clock say? A: 2 fifteen", "Q: Does the clock say 2 fifteen ? A: yes", "what"], ["Q: What brand shirt is he wearing? A: nike", "Q: Is he wearing nike ? A: yes", "what"], ["Q: What sort of numerals are on the clock? A: basic", "Q: Are basic numerals on the clock ? A: yes", "what"], ["Q: Who does the man on the right resemble? A: obama", "Q: Does the man on the right resemble obama? A: yes", "N/A"], ["Q: What is roosting in a tree? A: rooster", "Q: Is a rooster roosting in a tree ? A: yes", "what"], ["Q: Is there toilet paper on the roll? A: yes", "N/A", "N/A"], ["Q: How many windows are there? A: dozens", "Q: Are there dozens of windows? A: yes", "N/A"], ["Q: What are the stones on the grounds? A: headstones", "Q: Are the stones on the grounds headstones ? A: yes", "what"], ["Q: What is on display? A: bottles", "Q: Are bottles on display ? A: yes", "what"], ["Q: Is the headboard made of steel? A: no", "Q: Is the headboard not made of steel? A: yes", "N/A"], ["Q: How many cubicles are in the white shelves? A: 7", "Q: Are there 7 cubicles in the white shelves? A: yes", "yeseqcount"], ["Q: What material is the tablecloth made of? A: white", "Q: Is the tablecloth made of white ? A: yes", "what"], ["Q: What is the cat looking at? A: couch", "Q: Is the cat looking at the couch ? A: yes", "what"], ["Q: What kind of sports team is this? A: soccer", "Q: Is this a soccer team? A: yes", "what"], ["Q: What is the message written on? A: metal sign", "Q: Is the message written on the metal sign ? A: yes", "what"], ["Q: What kind of flower is it? A: daffodil", "Q: Is it daffodil ? A: yes", "what"], ["Q: What is the painting all over the truck? A: pumpkins", "Q: Is the painting all over the truck pumpkins ? A: yes", "what"], ["Q: What kind of animals is in the picture? A: zebras", "Q: Is the zebras in the picture ? A: yes", "what"], ["Q: What color is the hydrant? A: black white red", "Q: Is the hydrant black white red ? A: yes", "what"], ["Q: Where are these women standing? A: on tennis court", "Q: Are these women standing on a tennis court ? A: yes", "where"], ["Q: Are the three bags of fish waiting to go somewhere? A: yes", "N/A", "N/A"], ["Q: What brand is this child's shoes? A: adidas", "Q: Is this child 's shoes adidas ? A: yes", "what"], ["Q: Where are the fashions? A: men's", "Q: Are the fashions men's ? A: yes", "where"], ["Q: Are they in a fence? A: yes", "N/A", "N/A"], ["Q: What is the man on the right doing? A: playing video game", "Q: Is the man on the right playing video game ? A: yes", "what"], ["Q: What ingredients would you add? A: salt and pepper", "Q: Would you add the salt and pepper ? A: yes", "what"], ["Q: Is the batter hitting left handed? A: right", "Q: Is the batter hitting right handed? A: yes", "N/A"], ["Q: What is the object next to the chimney? A: sign", "Q: Is there a sign next to the chimney? A: yes", "what"], ["Q: What color is the girl's shirt? A: burgundy", "Q: Is the girl 's shirt burgundy ? A: yes", "what"], ["Q: What kind of building is this? A: hotel", "Q: Is this a hotel ? A: yes", "what"], ["Q: Did the man use the toilet yet or is him about to use it? A: used", "Q: Did the man use the toilet? A: yes", "N/A"], ["Q: How many trees in the picture? A: more than 5", "Q: Are there more than 5 trees in the picture? A: yes", "N/A"], ["Q: What are the elephants leaning standing in front of? A: water", "Q: Are the elephants leaning standing in front of the water ? A: yes", "what"], ["Q: How many planes are pictured? A: 1", "Q: Is there 1 plane pictured? A: yes", "yeseqcount"], ["Q: What game console are the men playing with? A: phone", "Q: Are the men playing with the phone ? A: yes", "what"], ["Q: Is the person walking or running? A: neither", "Q: Is the person neither walking nor running? A: yes", "N/A"], ["Q: What instrument is in his hand? A: wiimote", "Q: Is the wiimote in his hand ? A: yes", "what"], ["Q: What color is the baby elephant? A: light gray", "Q: Is the baby elephant light gray ? A: yes", "what"], ["Q: Is this man a pro? A: yes", "N/A", "N/A"], ["Q: How old is this child? A: 1 year", "Q: Is this child 1 year old? A: yes", "N/A"], ["Q: How many blades of grass? A: 10000", "Q: Are there 10000 blades of grass ? A: yes", "yeseqcount"], ["Q: What does the life preserver say? A: 0", "Q: Does the life preserver say 0 ? A: yes", "what"], ["Q: Is this doll wearing a belt? A: yes", "N/A", "N/A"], ["Q: What is the destination for these planes? A: base", "Q: Is the destination for these planes base ? A: yes", "what"], ["Q: Where is the market located? A: city center", "Q: Is the market located in a city center ? A: yes", "where"], ["Q: Where is the microwave? A: fridge top", "Q: Is the microwave on the fridge top ? A: yes", "where"], ["Q: What are the toppings on the pizza? A: tomato/mushroom", "Q: Are the toppings on the pizza tomato/mushroom ? A: yes", "what"], ["Q: What's the word on the building? A: gecko", "Q: Is the word on the building gecko ? A: yes", "what"], ["Q: What are the slices of green things? A: moth", "Q: Are the slices of green things moth ? A: yes", "what"], ["Q: What kind of birds are those most likely to be? A: gulls", "Q: Are those most likely to be gulls ? A: yes", "what"], ["Q: What type of bear is that? A: grizzly", "Q: Is that a grizzly ? A: yes", "what"], ["Q: Are the hot dogs ready to eat? A: half of them", "Q: Are half of the hot dogs ready to eat? A: yes", "N/A"], ["Q: Why does this zebra have stripes? A: camouflage", "Q: Does this zebra have stripes to camouflage? A: yes", "N/A"], ["Q: What color is the man shirt in the middle? A: white", "Q: Is the man shirt in the middle white ? A: yes", "what"], ["Q: Is it likely a blind person would recognize numerous tactile elements here? A: yes", "N/A", "N/A"], ["Q: Where is the sink in the picture? A: kitchen", "Q: Is the sink in the picture in the kitchen ? A: yes", "where"], ["Q: What kind of flowers? A: daisy", "Q: Are the flowers daisy? A: yes", "N/A"], ["Q: What is this bird standing on? A: man", "Q: Is this bird standing on a man ? A: yes", "what"], ["Q: What color is the bear's nose? A: brown", "Q: Is the bear 's nose brown ? A: yes", "what"], ["Q: Are you allowed to park here? A: maybe", "N/A", "N/A"], ["Q: Where is the sink? A: under window", "Q: Is the sink under the window ? A: yes", "where"], ["Q: How do you know these items are for sale? A: price signs", "Q: Do the price signs show these items are for sale? A: yes", "N/A"], ["Q: Is the electrical outlet full? A: no", "Q: Is the electrical outlet not full? A: yes", "N/A"], ["Q: How many dots are on the giraffe? A: lot", "Q: Are there lot of dots on the giraffe? A: yes", "N/A"], ["Q: What is the animal looking at? A: man", "Q: Is the animal looking at the man ? A: yes", "what"], ["Q: What is in motion here? A: surfboard", "Q: Is here surfboard in motion ? A: yes", "what"], ["Q: What is on the black cows face? A: eyes and nose", "Q: Are the eyes and nose on the black cows face ? A: yes", "what"], ["Q: Where is the cat? A: toilet", "Q: Is the cat in the toilet ? A: yes", "where"], ["Q: Which player is in the middle? A: in back", "N/A", "N/A"], ["Q: What material is covering the floor? A: dog", "Q: Is the dog covering the floor ? A: yes", "what"], ["Q: What brand of phone is labeled on the side of the bus? A: ipod apple", "Q: Is the ipod apple labeled on the side of the bus ? A: yes", "what"], ["Q: What breed of dog is that? A: doberman", "Q: Is that a doberman ? A: yes", "what"], ["Q: What is standing on the water? A: birds", "Q: Are the birds standing on the water ? A: yes", "what"], ["Q: Is the couple young? A: no couple pictures", "Q: Is there no couple in the pictures? A: yes", "N/A"], ["Q: Where is this man possibly standing? A: not standing", "Q: Is this man not standing ? A: yes", "where"], ["Q: How many of the luggage pieces are black? A: 2", "Q: Are there 2 of the luggage pieces black ? A: yes", "yeseqcount"], ["Q: What are they about to do? A: ski", "Q: Are they about to ski ? A: yes", "what"], ["Q: Do these pizzas have ranch dressing on them? A: no", "Q: Do these pizzas have no ranch dressing on them? A: yes", "N/A"], ["Q: What is on the shoreline? A: rocks", "Q: Are the rocks on the shoreline ? A: yes", "what"], ["Q: What company is shown in the background? A: c", "Q: Is a c company shown in the background ? A: yes", "what"], ["Q: What does the sign say right behind the man? A: bus", "Q: Does the sign say bus right behind the man? A: yes", "what"], ["Q: What sport is the woman practicing? A: snowboarding", "Q: Is the woman practicing snowboarding ? A: yes", "what"], ["Q: What bus is in the front? A: 662", "Q: Is the bus 662 in the front ? A: yes", "what"], ["Q: Who are on the motorcycle? A: bob and sue", "Q: Are bob and sue on the motorcycle? A: yes", "N/A"], ["Q: What is the green thing called? A: spinach", "Q: Is the green thing called spinach ? A: yes", "what"], ["Q: What color are the leaves on the plate? A: none", "Q: Are the leaves on the plate none ? A: yes", "what"], ["Q: Is it almost 2:00? A: yes", "N/A", "N/A"], ["Q: In what style is the woman wearing the hair? A: short", "Q: Is the woman wearing short hair? A: yes", "N/A"], ["Q: Does the shower have small tile? A: no", "Q: Does the shower not have small tile? A: yes", "N/A"], ["Q: What is the kid looking at? A: wii", "Q: Is the kid looking at wii ? A: yes", "what"], ["Q: How many people can you see on the boat? A: about 30", "Q: Can you see about 30 people on the boat? A: yes", "N/A"], ["Q: What time does it say? A: 330", "Q: Does it say 330 ? A: yes", "what"], ["Q: Where is this building? A: outside", "Q: Is this building outside ? A: yes", "where"], ["Q: Why is there tape on the appliance? A: new", "Q: Is the appliance new? A: yes", "N/A"], ["Q: Where is the train heading? A: train station", "Q: Is the train heading to train station ? A: yes", "where"], ["Q: Are these boys? A: no", "Q: Are these not boys? A: yes", "N/A"], ["Q: What material are the steps made of? A: stone", "Q: Are the steps made of stone ? A: yes", "what"], ["Q: What is the black liquid in the coffee pot? A: coffee", "Q: Is the black liquid in the coffee pot a coffee ? A: yes", "what"], ["Q: What color is the building in the background? A: hyundai dealership", "Q: Is the building in the background hyundai dealership ? A: yes", "what"], ["Q: What is this scene of? A: marina", "Q: Is this scene of a marina ? A: yes", "what"], ["Q: How many people can be seen? A: 7", "Q: Can 7 people be seen? A: yes", "yeseqcount"], ["Q: What is the man drinking? A: brandy", "Q: Is the man drinking brandy ? A: yes", "what"], ["Q: What birds are these? A: small", "Q: Are these small birds? A: yes", "what"], ["Q: Where is the jug with the stopper? A: teddy bear lap", "Q: Is the jug with the stopper teddy bear lap ? A: yes", "where"], ["Q: What brand is the wetsuit? A: rip curl", "Q: Is the wetsuit rip curl ? A: yes", "what"], ["Q: Does his shirt match his surfboard? A: yes", "N/A", "N/A"], ["Q: What is the foaming white substance? A: surf", "Q: Is the foaming white substance surf ? A: yes", "what"], ["Q: How many rocks are there? A: about 6", "Q: Are there about 6 rocks? A: yes", "N/A"], ["Q: How many sailboats are there? A: 1", "Q: Is there 1 sailboat ? A: yes", "yeseqcount"], ["Q: What is showing on the computer? A: graphics", "Q: Are the graphics showing on the computer ? A: yes", "what"], ["Q: How many live dogs? A: 1", "Q: Is there 1 live dog ? A: yes", "yeseqcount"], ["Q: What is the hose being used for? A: water", "Q: Is the hose being used for water ? A: yes", "what"], ["Q: How many people hanging out the windows? A: 5", "Q:  5 people hanging out the windows? A: yes", "yeseqcount"], ["Q: What is the relative temperature in this picture? A: 80 degrees", "Q: Is the relative temperature in this picture 80 degrees ? A: yes", "what"], ["Q: What color is the vegetable? A: yellow", "Q: Is the vegetable yellow ? A: yes", "what"], ["Q: Is the green and purple phone on? A: no", "Q: Is the green and purple phone off? A: yes", "N/A"], ["Q: What are the colored items used for? A: flowers", "Q: Are the colored items used for the flowers ? A: yes", "what"], ["Q: What is the green food called? A: peas", "Q: Is the green food called peas ? A: yes", "what"], ["Q: Where is the water bottle? A: on bike frame", "Q: Is the water bottle on the bike frame ? A: yes", "where"], ["Q: What kind of headwater is the man on the left wearing? A: spring", "Q: Is the man on the left wearing a spring ? A: yes", "what"], ["Q: How many fruits are there? A: 1", "Q: Is there 1 fruit ? A: yes", "yeseqcount"], ["Q: What event is shown? A: tennis competition", "Q: Is the tennis competition shown ? A: yes", "what"], ["Q: What is the brand of his shoes? A: adidas", "Q: Is the brand of his shoes adidas ? A: yes", "what"], ["Q: What are those objects lined up on the shelf? A: cds", "Q: Are those objects lined up on the shelf cds ? A: yes", "what"], ["Q: What kind of bread is on this sandwich? A: croissant", "Q: Is the croissant on this sandwich ? A: yes", "what"], ["Q: How many vases are there? A: 3", "Q: Are there 3 vases ? A: yes", "yeseqcount"], ["Q: Who does the shirt belong too? A: owner", "Q: Does the shirt belong too owner? A: yes", "N/A"], ["Q: Why are people gathered on the street? A: protect", "Q: Are people gathered on the street to protect? A: yes", "N/A"], ["Q: What type of room is this? A: bedroom", "Q: Is this a bedroom ? A: yes", "what"], ["Q: What is the picture made of? A: people", "Q: Is the picture made of people ? A: yes", "what"], ["Q: Is someone touching the fire hydrant? A: yes", "N/A", "N/A"], ["Q: Is the parking during snow emergency allowed? A: yes at certain times", "Q: Is the parking during snow emergency allowed at certain times? A: yes", "N/A"], ["Q: What is this guy doing? A: tricks", "Q: Is this guy doing tricks ? A: yes", "what"], ["Q: What color is his hat and jacket? A: brown hat, grey jacket", "Q: Is his hat and jacket brown hat, grey jacket ? A: yes", "what"], ["Q: What is the cat looking at? A: his person", "Q: Is the cat looking at his person ? A: yes", "what"], ["Q: Is the man in the air perpendicular? A: yes", "N/A", "N/A"], ["Q: What is the person drinking out of? A: solo cup", "Q: Is the person drinking out of solo cup ? A: yes", "what"], ["Q: What country's flag is in this picture? A: swedish", "Q: Is a swedish flag in this picture? A: yes", "N/A"], ["Q: What is on the player's left leg? A: pad", "Q: Is the pad on the player 's left leg ? A: yes", "what"], ["Q: What kind of trees are those tall one's behind the giraffe? A: regular", "Q: Are those tall one 's behind the giraffe regular ? A: yes", "what"], ["Q: Name a product that gives from this type of animal? A: plants", "Q: Are plants given from this type of animal? A: yes", "N/A"], ["Q: Is the refrigerator full of magnets? A: no", "Q: Is the refrigerator not full of magnets? A: yes", "N/A"], ["Q: What vegetable is grilled? A: onion", "Q: Is the onion grilled ? A: yes", "what"], ["Q: What color of dog is laying on the ground? A: yellow and black", "Q: Is the yellow and black dog laying on the ground ? A: yes", "what"], ["Q: How many leaves are on the branch behind the bird? A: 4", "Q: Are there 4 leaves on the branch behind the bird? A: yes", "yeseqcount"], ["Q: What types of birds are around the bear? A: blackbirds", "Q: Are the blackbirds around the bear ? A: yes", "what"], ["Q: What competitive event is this? A: rafting", "Q: Is this a rafting ? A: yes", "what"], ["Q: What is the title of the green book? A: my best guess is planner", "Q: Is the title of the green book my best guess is planner ? A: yes", "what"], ["Q: What appliances are on the counter? A: teapot", "Q: Are the teapot on the counter ? A: yes", "what"], ["Q: Are any boats passing by? A: no", "Q: Are no boats passing by? A: yes", "N/A"], ["Q: What is the occasion of the event? A: summer market", "Q: Is the occasion of the event summer market ? A: yes", "what"], ["Q: How are the scissors placed? A: on top", "Q: Are the scissors placed on top? A: yes", "N/A"], ["Q: What type of vessel are these items in? A: pot", "Q: Are these items in the pot ? A: yes", "what"], ["Q: What is the woman? A: both", "Q: Is the woman both ? A: yes", "what"], ["Q: Is this kitchen large? A: no", "Q: Is this kitchen not large? A: yes", "N/A"], ["Q: What's above the toilet paper? A: phone", "Q: Is phone above the toilet paper ? A: yes", "what"], ["Q: How many boats are in the photo? A: 2", "Q: Are there 2 boats in the photo? A: yes", "yeseqcount"], ["Q: Is the woman eating pizza? A: yes", "N/A", "N/A"]]